robertlipe/svdtoheaders/demo/h/ch32v307_reg.h

/* RNG - Random number generator */
#define CH32V_RNG_BASE                    0x40023c00
#define CH32V_RNG_CR_OFFSET               0x0000
#define CH32V_RNG_CR                      (CH32V_RNG_BASE + CH32V_RNG_CR_OFFSET) /* read-write */
#define CH32V_RNG_CR_IE                   (1 <<  3) /* 00000008: Interrupt enable */
#define CH32V_RNG_CR_RNGEN                (1 <<  2) /* 00000004: Random number generator enable */
#define CH32V_RNG_SR_OFFSET               0x0004
#define CH32V_RNG_SR                      (CH32V_RNG_BASE + CH32V_RNG_SR_OFFSET)
#define CH32V_RNG_SR_SEIS                 (1 <<  6) /* 00000040: Seed error interrupt status */
#define CH32V_RNG_SR_CEIS                 (1 <<  5) /* 00000020: Clock error interrupt status */
#define CH32V_RNG_SR_SECS                 (1 <<  2) /* 00000004: Seed error current status */
#define CH32V_RNG_SR_CECS                 (1 <<  1) /* 00000002: Clock error current status */
#define CH32V_RNG_SR_DRDY                 (1 <<  0) /* 00000001: Data ready */
#define CH32V_RNG_DR_OFFSET               0x0008
#define CH32V_RNG_DR                      (CH32V_RNG_BASE + CH32V_RNG_DR_OFFSET) /* read-only */
#define CH32V_RNG_DR_RNDATA               (0xffffffff << 0) /* ffffffff: Random data */
#define CH32V_RNG_DR_RNDATA_MASK          (0xffffffff << 0)

/* USB - Universal serial bus full-speed device interface */
#define CH32V_USB_BASE                    0x40005c00
#define CH32V_USB_EP0R_OFFSET             0x0000
#define CH32V_USB_EP0R                    (CH32V_USB_BASE + CH32V_USB_EP0R_OFFSET) /* read-write */
#define CH32V_USB_EP0R_EA                 (0xf << 0) /* 0000000f: Endpoint address */
#define CH32V_USB_EP0R_EA_MASK            (0xf << 0)
#define CH32V_USB_EP0R_STAT_TX            (0x3 << 4) /* 00000030: Status bits, for transmission transfers */
#define CH32V_USB_EP0R_STAT_TX_MASK       (0x3 << 4)
#define CH32V_USB_EP0R_DTOG_TX            (1 <<  6) /* 00000040: Data Toggle, for transmission transfers */
#define CH32V_USB_EP0R_CTR_TX             (1 <<  7) /* 00000080: Correct Transfer for transmission */
#define CH32V_USB_EP0R_EP_KIND            (1 <<  8) /* 00000100: Endpoint kind */
#define CH32V_USB_EP0R_EP_TYPE            (0x3 << 9) /* 00000600: Endpoint type */
#define CH32V_USB_EP0R_EP_TYPE_MASK       (0x3 << 9)
#define CH32V_USB_EP0R_SETUP              (1 << 11) /* 00000800: Setup transaction completed */
#define CH32V_USB_EP0R_STAT_RX            (0x3 << 12) /* 00003000: Status bits, for reception transfers */
#define CH32V_USB_EP0R_STAT_RX_MASK       (0x3 << 12)
#define CH32V_USB_EP0R_DTOG_RX            (1 << 14) /* 00004000: Data Toggle, for reception transfers */
#define CH32V_USB_EP0R_CTR_RX             (1 << 15) /* 00008000: Correct transfer for reception */
#define CH32V_USB_EP1R_OFFSET             0x0004
#define CH32V_USB_EP1R                    (CH32V_USB_BASE + CH32V_USB_EP1R_OFFSET) /* read-write */
#define CH32V_USB_EP1R_EA                 (0xf << 0) /* 0000000f: Endpoint address */
#define CH32V_USB_EP1R_EA_MASK            (0xf << 0)
#define CH32V_USB_EP1R_STAT_TX            (0x3 << 4) /* 00000030: Status bits, for transmission transfers */
#define CH32V_USB_EP1R_STAT_TX_MASK       (0x3 << 4)
#define CH32V_USB_EP1R_DTOG_TX            (1 <<  6) /* 00000040: Data Toggle, for transmission transfers */
#define CH32V_USB_EP1R_CTR_TX             (1 <<  7) /* 00000080: Correct Transfer for transmission */
#define CH32V_USB_EP1R_EP_KIND            (1 <<  8) /* 00000100: Endpoint kind */
#define CH32V_USB_EP1R_EP_TYPE            (0x3 << 9) /* 00000600: Endpoint type */
#define CH32V_USB_EP1R_EP_TYPE_MASK       (0x3 << 9)
#define CH32V_USB_EP1R_SETUP              (1 << 11) /* 00000800: Setup transaction completed */
#define CH32V_USB_EP1R_STAT_RX            (0x3 << 12) /* 00003000: Status bits, for reception transfers */
#define CH32V_USB_EP1R_STAT_RX_MASK       (0x3 << 12)
#define CH32V_USB_EP1R_DTOG_RX            (1 << 14) /* 00004000: Data Toggle, for reception transfers */
#define CH32V_USB_EP1R_CTR_RX             (1 << 15) /* 00008000: Correct transfer for reception */
#define CH32V_USB_EP2R_OFFSET             0x0008
#define CH32V_USB_EP2R                    (CH32V_USB_BASE + CH32V_USB_EP2R_OFFSET) /* read-write */
#define CH32V_USB_EP2R_EA                 (0xf << 0) /* 0000000f: Endpoint address */
#define CH32V_USB_EP2R_EA_MASK            (0xf << 0)
#define CH32V_USB_EP2R_STAT_TX            (0x3 << 4) /* 00000030: Status bits, for transmission transfers */
#define CH32V_USB_EP2R_STAT_TX_MASK       (0x3 << 4)
#define CH32V_USB_EP2R_DTOG_TX            (1 <<  6) /* 00000040: Data Toggle, for transmission transfers */
#define CH32V_USB_EP2R_CTR_TX             (1 <<  7) /* 00000080: Correct Transfer for transmission */
#define CH32V_USB_EP2R_EP_KIND            (1 <<  8) /* 00000100: Endpoint kind */
#define CH32V_USB_EP2R_EP_TYPE            (0x3 << 9) /* 00000600: Endpoint type */
#define CH32V_USB_EP2R_EP_TYPE_MASK       (0x3 << 9)
#define CH32V_USB_EP2R_SETUP              (1 << 11) /* 00000800: Setup transaction completed */
#define CH32V_USB_EP2R_STAT_RX            (0x3 << 12) /* 00003000: Status bits, for reception transfers */
#define CH32V_USB_EP2R_STAT_RX_MASK       (0x3 << 12)
#define CH32V_USB_EP2R_DTOG_RX            (1 << 14) /* 00004000: Data Toggle, for reception transfers */
#define CH32V_USB_EP2R_CTR_RX             (1 << 15) /* 00008000: Correct transfer for reception */
#define CH32V_USB_EP3R_OFFSET             0x000c
#define CH32V_USB_EP3R                    (CH32V_USB_BASE + CH32V_USB_EP3R_OFFSET) /* read-write */
#define CH32V_USB_EP3R_EA                 (0xf << 0) /* 0000000f: Endpoint address */
#define CH32V_USB_EP3R_EA_MASK            (0xf << 0)
#define CH32V_USB_EP3R_STAT_TX            (0x3 << 4) /* 00000030: Status bits, for transmission transfers */
#define CH32V_USB_EP3R_STAT_TX_MASK       (0x3 << 4)
#define CH32V_USB_EP3R_DTOG_TX            (1 <<  6) /* 00000040: Data Toggle, for transmission transfers */
#define CH32V_USB_EP3R_CTR_TX             (1 <<  7) /* 00000080: Correct Transfer for transmission */
#define CH32V_USB_EP3R_EP_KIND            (1 <<  8) /* 00000100: Endpoint kind */
#define CH32V_USB_EP3R_EP_TYPE            (0x3 << 9) /* 00000600: Endpoint type */
#define CH32V_USB_EP3R_EP_TYPE_MASK       (0x3 << 9)
#define CH32V_USB_EP3R_SETUP              (1 << 11) /* 00000800: Setup transaction completed */
#define CH32V_USB_EP3R_STAT_RX            (0x3 << 12) /* 00003000: Status bits, for reception transfers */
#define CH32V_USB_EP3R_STAT_RX_MASK       (0x3 << 12)
#define CH32V_USB_EP3R_DTOG_RX            (1 << 14) /* 00004000: Data Toggle, for reception transfers */
#define CH32V_USB_EP3R_CTR_RX             (1 << 15) /* 00008000: Correct transfer for reception */
#define CH32V_USB_EP4R_OFFSET             0x0010
#define CH32V_USB_EP4R                    (CH32V_USB_BASE + CH32V_USB_EP4R_OFFSET) /* read-write */
#define CH32V_USB_EP4R_EA                 (0xf << 0) /* 0000000f: Endpoint address */
#define CH32V_USB_EP4R_EA_MASK            (0xf << 0)
#define CH32V_USB_EP4R_STAT_TX            (0x3 << 4) /* 00000030: Status bits, for transmission transfers */
#define CH32V_USB_EP4R_STAT_TX_MASK       (0x3 << 4)
#define CH32V_USB_EP4R_DTOG_TX            (1 <<  6) /* 00000040: Data Toggle, for transmission transfers */
#define CH32V_USB_EP4R_CTR_TX             (1 <<  7) /* 00000080: Correct Transfer for transmission */
#define CH32V_USB_EP4R_EP_KIND            (1 <<  8) /* 00000100: Endpoint kind */
#define CH32V_USB_EP4R_EP_TYPE            (0x3 << 9) /* 00000600: Endpoint type */
#define CH32V_USB_EP4R_EP_TYPE_MASK       (0x3 << 9)
#define CH32V_USB_EP4R_SETUP              (1 << 11) /* 00000800: Setup transaction completed */
#define CH32V_USB_EP4R_STAT_RX            (0x3 << 12) /* 00003000: Status bits, for reception transfers */
#define CH32V_USB_EP4R_STAT_RX_MASK       (0x3 << 12)
#define CH32V_USB_EP4R_DTOG_RX            (1 << 14) /* 00004000: Data Toggle, for reception transfers */
#define CH32V_USB_EP4R_CTR_RX             (1 << 15) /* 00008000: Correct transfer for reception */
#define CH32V_USB_EP5R_OFFSET             0x0014
#define CH32V_USB_EP5R                    (CH32V_USB_BASE + CH32V_USB_EP5R_OFFSET) /* read-write */
#define CH32V_USB_EP5R_EA                 (0xf << 0) /* 0000000f: Endpoint address */
#define CH32V_USB_EP5R_EA_MASK            (0xf << 0)
#define CH32V_USB_EP5R_STAT_TX            (0x3 << 4) /* 00000030: Status bits, for transmission transfers */
#define CH32V_USB_EP5R_STAT_TX_MASK       (0x3 << 4)
#define CH32V_USB_EP5R_DTOG_TX            (1 <<  6) /* 00000040: Data Toggle, for transmission transfers */
#define CH32V_USB_EP5R_CTR_TX             (1 <<  7) /* 00000080: Correct Transfer for transmission */
#define CH32V_USB_EP5R_EP_KIND            (1 <<  8) /* 00000100: Endpoint kind */
#define CH32V_USB_EP5R_EP_TYPE            (0x3 << 9) /* 00000600: Endpoint type */
#define CH32V_USB_EP5R_EP_TYPE_MASK       (0x3 << 9)
#define CH32V_USB_EP5R_SETUP              (1 << 11) /* 00000800: Setup transaction completed */
#define CH32V_USB_EP5R_STAT_RX            (0x3 << 12) /* 00003000: Status bits, for reception transfers */
#define CH32V_USB_EP5R_STAT_RX_MASK       (0x3 << 12)
#define CH32V_USB_EP5R_DTOG_RX            (1 << 14) /* 00004000: Data Toggle, for reception transfers */
#define CH32V_USB_EP5R_CTR_RX             (1 << 15) /* 00008000: Correct transfer for reception */
#define CH32V_USB_EP6R_OFFSET             0x0018
#define CH32V_USB_EP6R                    (CH32V_USB_BASE + CH32V_USB_EP6R_OFFSET) /* read-write */
#define CH32V_USB_EP6R_EA                 (0xf << 0) /* 0000000f: Endpoint address */
#define CH32V_USB_EP6R_EA_MASK            (0xf << 0)
#define CH32V_USB_EP6R_STAT_TX            (0x3 << 4) /* 00000030: Status bits, for transmission transfers */
#define CH32V_USB_EP6R_STAT_TX_MASK       (0x3 << 4)
#define CH32V_USB_EP6R_DTOG_TX            (1 <<  6) /* 00000040: Data Toggle, for transmission transfers */
#define CH32V_USB_EP6R_CTR_TX             (1 <<  7) /* 00000080: Correct Transfer for transmission */
#define CH32V_USB_EP6R_EP_KIND            (1 <<  8) /* 00000100: Endpoint kind */
#define CH32V_USB_EP6R_EP_TYPE            (0x3 << 9) /* 00000600: Endpoint type */
#define CH32V_USB_EP6R_EP_TYPE_MASK       (0x3 << 9)
#define CH32V_USB_EP6R_SETUP              (1 << 11) /* 00000800: Setup transaction completed */
#define CH32V_USB_EP6R_STAT_RX            (0x3 << 12) /* 00003000: Status bits, for reception transfers */
#define CH32V_USB_EP6R_STAT_RX_MASK       (0x3 << 12)
#define CH32V_USB_EP6R_DTOG_RX            (1 << 14) /* 00004000: Data Toggle, for reception transfers */
#define CH32V_USB_EP6R_CTR_RX             (1 << 15) /* 00008000: Correct transfer for reception */
#define CH32V_USB_EP7R_OFFSET             0x001c
#define CH32V_USB_EP7R                    (CH32V_USB_BASE + CH32V_USB_EP7R_OFFSET) /* read-write */
#define CH32V_USB_EP7R_EA                 (0xf << 0) /* 0000000f: Endpoint address */
#define CH32V_USB_EP7R_EA_MASK            (0xf << 0)
#define CH32V_USB_EP7R_STAT_TX            (0x3 << 4) /* 00000030: Status bits, for transmission transfers */
#define CH32V_USB_EP7R_STAT_TX_MASK       (0x3 << 4)
#define CH32V_USB_EP7R_DTOG_TX            (1 <<  6) /* 00000040: Data Toggle, for transmission transfers */
#define CH32V_USB_EP7R_CTR_TX             (1 <<  7) /* 00000080: Correct Transfer for transmission */
#define CH32V_USB_EP7R_EP_KIND            (1 <<  8) /* 00000100: Endpoint kind */
#define CH32V_USB_EP7R_EP_TYPE            (0x3 << 9) /* 00000600: Endpoint type */
#define CH32V_USB_EP7R_EP_TYPE_MASK       (0x3 << 9)
#define CH32V_USB_EP7R_SETUP              (1 << 11) /* 00000800: Setup transaction completed */
#define CH32V_USB_EP7R_STAT_RX            (0x3 << 12) /* 00003000: Status bits, for reception transfers */
#define CH32V_USB_EP7R_STAT_RX_MASK       (0x3 << 12)
#define CH32V_USB_EP7R_DTOG_RX            (1 << 14) /* 00004000: Data Toggle, for reception transfers */
#define CH32V_USB_EP7R_CTR_RX             (1 << 15) /* 00008000: Correct transfer for reception */
#define CH32V_USB_CNTR_OFFSET             0x0040
#define CH32V_USB_CNTR                    (CH32V_USB_BASE + CH32V_USB_CNTR_OFFSET) /* read-write */
#define CH32V_USB_CNTR_FRES               (1 <<  0) /* 00000001: Force USB Reset */
#define CH32V_USB_CNTR_PDWN               (1 <<  1) /* 00000002: Power down */
#define CH32V_USB_CNTR_LPMODE             (1 <<  2) /* 00000004: Low-power mode */
#define CH32V_USB_CNTR_FSUSP              (1 <<  3) /* 00000008: Force suspend */
#define CH32V_USB_CNTR_RESUME             (1 <<  4) /* 00000010: Resume request */
#define CH32V_USB_CNTR_ESOFM              (1 <<  8) /* 00000100: Expected start of frame interrupt mask */
#define CH32V_USB_CNTR_SOFM               (1 <<  9) /* 00000200: Start of frame interrupt mask */
#define CH32V_USB_CNTR_RESETM             (1 << 10) /* 00000400: USB reset interrupt mask */
#define CH32V_USB_CNTR_SUSPM              (1 << 11) /* 00000800: Suspend mode interrupt mask */
#define CH32V_USB_CNTR_WKUPM              (1 << 12) /* 00001000: Wakeup interrupt mask */
#define CH32V_USB_CNTR_ERRM               (1 << 13) /* 00002000: Error interrupt mask */
#define CH32V_USB_CNTR_PMAOVRM            (1 << 14) /* 00004000: Packet memory area over / underrun interrupt mask */
#define CH32V_USB_CNTR_CTRM               (1 << 15) /* 00008000: Correct transfer interrupt mask */
#define CH32V_USB_ISTR_OFFSET             0x0044
#define CH32V_USB_ISTR                    (CH32V_USB_BASE + CH32V_USB_ISTR_OFFSET) /* read-write */
#define CH32V_USB_ISTR_EP_ID              (0xf << 0) /* 0000000f: Endpoint Identifier */
#define CH32V_USB_ISTR_EP_ID_MASK         (0xf << 0)
#define CH32V_USB_ISTR_DIR                (1 <<  4) /* 00000010: Direction of transaction */
#define CH32V_USB_ISTR_ESOF               (1 <<  8) /* 00000100: Expected start frame */
#define CH32V_USB_ISTR_SOF                (1 <<  9) /* 00000200: start of frame */
#define CH32V_USB_ISTR_RESET              (1 << 10) /* 00000400: reset request */
#define CH32V_USB_ISTR_SUSP               (1 << 11) /* 00000800: Suspend mode request */
#define CH32V_USB_ISTR_WKUP               (1 << 12) /* 00001000: Wakeup */
#define CH32V_USB_ISTR_ERR                (1 << 13) /* 00002000: Error */
#define CH32V_USB_ISTR_PMAOVR             (1 << 14) /* 00004000: Packet memory area over / underrun */
#define CH32V_USB_ISTR_CTR                (1 << 15) /* 00008000: Correct transfer */
#define CH32V_USB_FNR_OFFSET              0x0048
#define CH32V_USB_FNR                     (CH32V_USB_BASE + CH32V_USB_FNR_OFFSET) /* read-only */
#define CH32V_USB_FNR_FN                  (0x7ff << 0) /* 000007ff: Frame number */
#define CH32V_USB_FNR_FN_MASK             (0x7ff << 0)
#define CH32V_USB_FNR_LSOF                (0x3 << 11) /* 00001800: Lost SOF */
#define CH32V_USB_FNR_LSOF_MASK           (0x3 << 11)
#define CH32V_USB_FNR_LCK                 (1 << 13) /* 00002000: Locked */
#define CH32V_USB_FNR_RXDM                (1 << 14) /* 00004000: Receive data - line status */
#define CH32V_USB_FNR_RXDP                (1 << 15) /* 00008000: Receive data + line status */
#define CH32V_USB_DADDR_OFFSET            0x004c
#define CH32V_USB_DADDR                   (CH32V_USB_BASE + CH32V_USB_DADDR_OFFSET) /* read-write */
#define CH32V_USB_DADDR_ADD               (0x7f << 0) /* 0000007f: Device address */
#define CH32V_USB_DADDR_ADD_MASK          (0x7f << 0)
#define CH32V_USB_DADDR_EF                (1 <<  7) /* 00000080: Enable function */
#define CH32V_USB_BTABLE_OFFSET           0x0050
#define CH32V_USB_BTABLE                  (CH32V_USB_BASE + CH32V_USB_BTABLE_OFFSET) /* read-write */
#define CH32V_USB_BTABLE_BTABLE           (0x1fff << 3) /* 0000fff8: Buffer table */
#define CH32V_USB_BTABLE_BTABLE_MASK      (0x1fff << 3)

