robertlipe/svdtoheaders/demo/h/ch32v307_reg.h
/* ETHERNET_DMA - Ethernet: DMA controller operation */
#define CH32V_ETHERNET_DMA_BASE           0x40029000
#define CH32V_ETHERNET_DMA_DMABMR_OFFSET  0x0000
#define CH32V_ETHERNET_DMA_DMABMR         (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMABMR_OFFSET) /* read-write */
#define CH32V_ETHERNET_DMA_DMABMR_SR      (1 <<  0) /* 00000001: Software reset */
#define CH32V_ETHERNET_DMA_DMABMR_DA      (1 <<  1) /* 00000002: DMA Arbitration */
#define CH32V_ETHERNET_DMA_DMABMR_DSL     (0x1f << 2) /* 0000007c: Descriptor skip length */
#define CH32V_ETHERNET_DMA_DMABMR_DSL_MASK (0x1f << 2)
#define CH32V_ETHERNET_DMA_DMABMR_PBL     (0x3f << 8) /* 00003f00: Programmable burst length */
#define CH32V_ETHERNET_DMA_DMABMR_PBL_MASK (0x3f << 8)
#define CH32V_ETHERNET_DMA_DMABMR_RTPR    (0x3 << 14) /* 0000c000: Rx Tx priority ratio */
#define CH32V_ETHERNET_DMA_DMABMR_RTPR_MASK (0x3 << 14)
#define CH32V_ETHERNET_DMA_DMABMR_FB      (1 << 16) /* 00010000: Fixed burst */
#define CH32V_ETHERNET_DMA_DMABMR_RDP     (0x3f << 17) /* 007e0000: Rx DMA PBL */
#define CH32V_ETHERNET_DMA_DMABMR_RDP_MASK (0x3f << 17)
#define CH32V_ETHERNET_DMA_DMABMR_USP     (1 << 23) /* 00800000: Use separate PBL */
#define CH32V_ETHERNET_DMA_DMABMR_FPM     (1 << 24) /* 01000000: 4xPBL mode */
#define CH32V_ETHERNET_DMA_DMABMR_AAB     (1 << 25) /* 02000000: Address-aligned beats */
#define CH32V_ETHERNET_DMA_DMATPDR_OFFSET 0x0004
#define CH32V_ETHERNET_DMA_DMATPDR        (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMATPDR_OFFSET) /* read-write */
#define CH32V_ETHERNET_DMA_DMATPDR_TPD    (0xffffffff << 0) /* ffffffff: Transmit poll demand */
#define CH32V_ETHERNET_DMA_DMATPDR_TPD_MASK (0xffffffff << 0)
#define CH32V_ETHERNET_DMA_DMARPDR_OFFSET 0x0008
#define CH32V_ETHERNET_DMA_DMARPDR        (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMARPDR_OFFSET) /* read-write */
#define CH32V_ETHERNET_DMA_DMARPDR_RPD    (0xffffffff << 0) /* ffffffff: Receive poll demand */
#define CH32V_ETHERNET_DMA_DMARPDR_RPD_MASK (0xffffffff << 0)
#define CH32V_ETHERNET_DMA_DMARDLAR_OFFSET 0x000c
#define CH32V_ETHERNET_DMA_DMARDLAR       (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMARDLAR_OFFSET) /* read-write */
#define CH32V_ETHERNET_DMA_DMARDLAR_SRL   (0xffffffff << 0) /* ffffffff: Start of receive list */
#define CH32V_ETHERNET_DMA_DMARDLAR_SRL_MASK (0xffffffff << 0)
#define CH32V_ETHERNET_DMA_DMATDLAR_OFFSET 0x0010
#define CH32V_ETHERNET_DMA_DMATDLAR       (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMATDLAR_OFFSET) /* read-write */
#define CH32V_ETHERNET_DMA_DMATDLAR_STL   (0xffffffff << 0) /* ffffffff: Start of transmit list */
#define CH32V_ETHERNET_DMA_DMATDLAR_STL_MASK (0xffffffff << 0)
#define CH32V_ETHERNET_DMA_DMASR_OFFSET   0x0014
#define CH32V_ETHERNET_DMA_DMASR          (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMASR_OFFSET)
#define CH32V_ETHERNET_DMA_DMASR_TS       (1 <<  0) /* 00000001: Transmit status */
#define CH32V_ETHERNET_DMA_DMASR_TPSS     (1 <<  1) /* 00000002: Transmit process stopped status */
#define CH32V_ETHERNET_DMA_DMASR_TBUS     (1 <<  2) /* 00000004: Transmit buffer unavailable status */
#define CH32V_ETHERNET_DMA_DMASR_TJTS     (1 <<  3) /* 00000008: Transmit jabber timeout status */
#define CH32V_ETHERNET_DMA_DMASR_ROS      (1 <<  4) /* 00000010: Receive overflow status */
#define CH32V_ETHERNET_DMA_DMASR_TUS      (1 <<  5) /* 00000020: Transmit underflow status */
#define CH32V_ETHERNET_DMA_DMASR_RS       (1 <<  6) /* 00000040: Receive status */
#define CH32V_ETHERNET_DMA_DMASR_RBUS     (1 <<  7) /* 00000080: Receive buffer unavailable status */
#define CH32V_ETHERNET_DMA_DMASR_RPSS     (1 <<  8) /* 00000100: Receive process stopped status */
#define CH32V_ETHERNET_DMA_DMASR_PWTS     (1 <<  9) /* 00000200: Receive watchdog timeout status */
#define CH32V_ETHERNET_DMA_DMASR_ETS      (1 << 10) /* 00000400: Early transmit status */
#define CH32V_ETHERNET_DMA_DMASR_FBES     (1 << 13) /* 00002000: Fatal bus error status */
#define CH32V_ETHERNET_DMA_DMASR_ERS      (1 << 14) /* 00004000: Early receive status */
#define CH32V_ETHERNET_DMA_DMASR_AIS      (1 << 15) /* 00008000: Abnormal interrupt summary */
#define CH32V_ETHERNET_DMA_DMASR_NIS      (1 << 16) /* 00010000: Normal interrupt summary */
#define CH32V_ETHERNET_DMA_DMASR_RPS      (0x7 << 17) /* 000e0000: Receive process state */
#define CH32V_ETHERNET_DMA_DMASR_RPS_MASK (0x7 << 17)
#define CH32V_ETHERNET_DMA_DMASR_TPS      (0x7 << 20) /* 00700000: Transmit process state */
#define CH32V_ETHERNET_DMA_DMASR_TPS_MASK (0x7 << 20)
#define CH32V_ETHERNET_DMA_DMASR_EBS      (0x7 << 23) /* 03800000: Error bits status */
#define CH32V_ETHERNET_DMA_DMASR_EBS_MASK (0x7 << 23)
#define CH32V_ETHERNET_DMA_DMASR_MMCS     (1 << 27) /* 08000000: MMC status */
#define CH32V_ETHERNET_DMA_DMASR_PMTS     (1 << 28) /* 10000000: PMT status */
#define CH32V_ETHERNET_DMA_DMASR_TSTS     (1 << 29) /* 20000000: Time stamp trigger status */
#define CH32V_ETHERNET_DMA_DMASR_IPLS     (1 << 31) /* 80000000: 10MPHY Physical layer variation */
#define CH32V_ETHERNET_DMA_DMAOMR_OFFSET  0x0018
#define CH32V_ETHERNET_DMA_DMAOMR         (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMAOMR_OFFSET) /* read-write */
#define CH32V_ETHERNET_DMA_DMAOMR_SR      (1 <<  1) /* 00000002: SR */
#define CH32V_ETHERNET_DMA_DMAOMR_OSF     (1 <<  2) /* 00000004: OSF */
#define CH32V_ETHERNET_DMA_DMAOMR_RTC     (0x3 << 3) /* 00000018: RTC */
#define CH32V_ETHERNET_DMA_DMAOMR_RTC_MASK (0x3 << 3)
#define CH32V_ETHERNET_DMA_DMAOMR_FUGF    (1 <<  6) /* 00000040: FUGF */
#define CH32V_ETHERNET_DMA_DMAOMR_FEF     (1 <<  7) /* 00000080: FEF */
#define CH32V_ETHERNET_DMA_DMAOMR_ST      (1 << 13) /* 00002000: ST */
#define CH32V_ETHERNET_DMA_DMAOMR_TTC     (0x7 << 14) /* 0001c000: TTC */
#define CH32V_ETHERNET_DMA_DMAOMR_TTC_MASK (0x7 << 14)
#define CH32V_ETHERNET_DMA_DMAOMR_FTF     (1 << 20) /* 00100000: FTF */
#define CH32V_ETHERNET_DMA_DMAOMR_TSF     (1 << 21) /* 00200000: TSF */
#define CH32V_ETHERNET_DMA_DMAOMR_DFRF    (1 << 24) /* 01000000: DFRF */
#define CH32V_ETHERNET_DMA_DMAOMR_RSF     (1 << 25) /* 02000000: RSF */
#define CH32V_ETHERNET_DMA_DMAOMR_DTCEFD  (1 << 26) /* 04000000: DTCEFD */
#define CH32V_ETHERNET_DMA_DMAIER_OFFSET  0x001c
#define CH32V_ETHERNET_DMA_DMAIER         (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMAIER_OFFSET) /* read-write */
#define CH32V_ETHERNET_DMA_DMAIER_TIE     (1 <<  0) /* 00000001: Transmit interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_TPSIE   (1 <<  1) /* 00000002: Transmit process stopped interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_TBUIE   (1 <<  2) /* 00000004: Transmit buffer unavailable interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_TJTIE   (1 <<  3) /* 00000008: Transmit jabber timeout interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_ROIE    (1 <<  4) /* 00000010: Overflow interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_TUIE    (1 <<  5) /* 00000020: Underflow interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_RIE     (1 <<  6) /* 00000040: Receive interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_RBUIE   (1 <<  7) /* 00000080: Receive buffer unavailable interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_RPSIE   (1 <<  8) /* 00000100: Receive process stopped interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_RWTIE   (1 <<  9) /* 00000200: receive watchdog timeout interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_ETIE    (1 << 10) /* 00000400: Early transmit interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_FBEIE   (1 << 13) /* 00002000: Fatal bus error interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_ERIE    (1 << 14) /* 00004000: Early receive interrupt enable */
#define CH32V_ETHERNET_DMA_DMAIER_AISE    (1 << 15) /* 00008000: Abnormal interrupt summary enable */
#define CH32V_ETHERNET_DMA_DMAIER_NISE    (1 << 16) /* 00010000: Normal interrupt summary enable */
#define CH32V_ETHERNET_DMA_DMAIER_IPLE    (1 << 31) /* 80000000: 10M Physical layer connection */
#define CH32V_ETHERNET_DMA_DMAMFBOCR_OFFSET 0x0020
#define CH32V_ETHERNET_DMA_DMAMFBOCR      (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMAMFBOCR_OFFSET) /* read-only */
#define CH32V_ETHERNET_DMA_DMAMFBOCR_MFC  (0xffff << 0) /* 0000ffff: Missed frames by the controller */
#define CH32V_ETHERNET_DMA_DMAMFBOCR_MFC_MASK (0xffff << 0)
#define CH32V_ETHERNET_DMA_DMAMFBOCR_OMFC (1 << 16) /* 00010000: Overflow bit for missed frame counter */
#define CH32V_ETHERNET_DMA_DMAMFBOCR_MFA  (0x7ff << 17) /* 0ffe0000: Missed frames by the application */
#define CH32V_ETHERNET_DMA_DMAMFBOCR_MFA_MASK (0x7ff << 17)
#define CH32V_ETHERNET_DMA_DMAMFBOCR_OFOC (1 << 28) /* 10000000: Overflow bit for FIFO overflow counter */
#define CH32V_ETHERNET_DMA_DMACHTDR_OFFSET 0x0048
#define CH32V_ETHERNET_DMA_DMACHTDR       (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMACHTDR_OFFSET) /* read-only */
#define CH32V_ETHERNET_DMA_DMACHTDR_HTDAP (0xffffffff << 0) /* ffffffff: Host transmit descriptor address pointer */
#define CH32V_ETHERNET_DMA_DMACHTDR_HTDAP_MASK (0xffffffff << 0)
#define CH32V_ETHERNET_DMA_DMACHRDR_OFFSET 0x004c
#define CH32V_ETHERNET_DMA_DMACHRDR       (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMACHRDR_OFFSET) /* read-only */
#define CH32V_ETHERNET_DMA_DMACHRDR_HRDAP (0xffffffff << 0) /* ffffffff: Host receive descriptor address pointer */
#define CH32V_ETHERNET_DMA_DMACHRDR_HRDAP_MASK (0xffffffff << 0)
#define CH32V_ETHERNET_DMA_DMACHTBAR_OFFSET 0x0050
#define CH32V_ETHERNET_DMA_DMACHTBAR      (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMACHTBAR_OFFSET) /* read-only */
#define CH32V_ETHERNET_DMA_DMACHTBAR_HTBAP (0xffffffff << 0) /* ffffffff: Host transmit buffer address pointer */
#define CH32V_ETHERNET_DMA_DMACHTBAR_HTBAP_MASK (0xffffffff << 0)
#define CH32V_ETHERNET_DMA_DMACHRBAR_OFFSET 0x0054
#define CH32V_ETHERNET_DMA_DMACHRBAR      (CH32V_ETHERNET_DMA_BASE + CH32V_ETHERNET_DMA_DMACHRBAR_OFFSET) /* read-only */
#define CH32V_ETHERNET_DMA_DMACHRBAR_HRBAP (0xffffffff << 0) /* ffffffff: Host receive buffer address pointer */
#define CH32V_ETHERNET_DMA_DMACHRBAR_HRBAP_MASK (0xffffffff << 0)

/* SDIO - Secure digital input/output interface */
#define CH32V_SDIO_BASE                   0x40018000
#define CH32V_SDIO_POWER_OFFSET           0x0000
#define CH32V_SDIO_POWER                  (CH32V_SDIO_BASE + CH32V_SDIO_POWER_OFFSET) /* read-write */
#define CH32V_SDIO_POWER_PWRCTRL          (0x3 << 0) /* 00000003: Power supply control bits */
#define CH32V_SDIO_POWER_PWRCTRL_MASK     (0x3 << 0)
#define CH32V_SDIO_CLKCR_OFFSET           0x0004
#define CH32V_SDIO_CLKCR                  (CH32V_SDIO_BASE + CH32V_SDIO_CLKCR_OFFSET) /* read-write */
#define CH32V_SDIO_CLKCR_CLKDIV           (0xff << 0) /* 000000ff: Clock divide factor */
#define CH32V_SDIO_CLKCR_CLKDIV_MASK      (0xff << 0)
#define CH32V_SDIO_CLKCR_CLKEN            (1 <<  8) /* 00000100: Clock enable bit */
#define CH32V_SDIO_CLKCR_PWRSAV           (1 <<  9) /* 00000200: Power saving configuration bit */
#define CH32V_SDIO_CLKCR_BYPASS           (1 << 10) /* 00000400: Clock divider bypass enable bit */
#define CH32V_SDIO_CLKCR_WIDBUS           (0x3 << 11) /* 00001800: Wide bus mode enable bit */
#define CH32V_SDIO_CLKCR_WIDBUS_MASK      (0x3 << 11)
#define CH32V_SDIO_CLKCR_NEGEDGE          (1 << 13) /* 00002000: SDIO_CK dephasing selection bit */
#define CH32V_SDIO_CLKCR_HWFC_EN          (1 << 14) /* 00004000: HW Flow Control enable */
#define CH32V_SDIO_ARG_OFFSET             0x0008
#define CH32V_SDIO_ARG                    (CH32V_SDIO_BASE + CH32V_SDIO_ARG_OFFSET) /* read-write */
#define CH32V_SDIO_ARG_CMDARG             (0xffffffff << 0) /* ffffffff: Command argument */
#define CH32V_SDIO_ARG_CMDARG_MASK        (0xffffffff << 0)
#define CH32V_SDIO_CMD_OFFSET             0x000c
#define CH32V_SDIO_CMD                    (CH32V_SDIO_BASE + CH32V_SDIO_CMD_OFFSET) /* read-write */
#define CH32V_SDIO_CMD_CMDINDEX           (0x3f << 0) /* 0000003f: Command index */
#define CH32V_SDIO_CMD_CMDINDEX_MASK      (0x3f << 0)
#define CH32V_SDIO_CMD_WAITRESP           (0x3 << 6) /* 000000c0: Wait for response bits */
#define CH32V_SDIO_CMD_WAITRESP_MASK      (0x3 << 6)
#define CH32V_SDIO_CMD_WAITINT            (1 <<  8) /* 00000100: CPSM waits for interrupt request */
#define CH32V_SDIO_CMD_WAITPEND           (1 <<  9) /* 00000200: CPSM Waits for ends of data transfer (CmdPend internal signal) */
#define CH32V_SDIO_CMD_CPSMEN             (1 << 10) /* 00000400: Command path state machine (CPSM) Enable bit */
#define CH32V_SDIO_CMD_SDIOSuspend        (1 << 11) /* 00000800: SD I/O suspend command */
#define CH32V_SDIO_CMD_ENCMDcompl         (1 << 12) /* 00001000: Enable CMD completion */
#define CH32V_SDIO_CMD_nIEN               (1 << 13) /* 00002000: not Interrupt Enable */
#define CH32V_SDIO_CMD_CE_ATACMD          (1 << 14) /* 00004000: CE-ATA command */
#define CH32V_SDIO_RESPCMD_OFFSET         0x0010
#define CH32V_SDIO_RESPCMD                (CH32V_SDIO_BASE + CH32V_SDIO_RESPCMD_OFFSET) /* read-only */
#define CH32V_SDIO_RESPCMD_RESPCMD        (0x3f << 0) /* 0000003f: Response command index */
#define CH32V_SDIO_RESPCMD_RESPCMD_MASK   (0x3f << 0)
#define CH32V_SDIO_RESP1_OFFSET           0x0014
#define CH32V_SDIO_RESP1                  (CH32V_SDIO_BASE + CH32V_SDIO_RESP1_OFFSET) /* read-only */
#define CH32V_SDIO_RESP1_CARDSTATUS1      (0xffffffff << 0) /* ffffffff: Card status 1 */
#define CH32V_SDIO_RESP1_CARDSTATUS1_MASK (0xffffffff << 0)
#define CH32V_SDIO_RESP2_OFFSET           0x0018
#define CH32V_SDIO_RESP2                  (CH32V_SDIO_BASE + CH32V_SDIO_RESP2_OFFSET) /* read-only */
#define CH32V_SDIO_RESP2_CARDSTATUS2      (0xffffffff << 0) /* ffffffff: Card status 2 */
#define CH32V_SDIO_RESP2_CARDSTATUS2_MASK (0xffffffff << 0)
#define CH32V_SDIO_RESP3_OFFSET           0x001c
#define CH32V_SDIO_RESP3                  (CH32V_SDIO_BASE + CH32V_SDIO_RESP3_OFFSET) /* read-only */
#define CH32V_SDIO_RESP3_CARDSTATUS3      (0xffffffff << 0) /* ffffffff: Card status 3 */
#define CH32V_SDIO_RESP3_CARDSTATUS3_MASK (0xffffffff << 0)
#define CH32V_SDIO_RESP4_OFFSET           0x0020
#define CH32V_SDIO_RESP4                  (CH32V_SDIO_BASE + CH32V_SDIO_RESP4_OFFSET) /* read-only */
#define CH32V_SDIO_RESP4_CARDSTATUS4      (0xffffffff << 0) /* ffffffff: Card status 4 */
#define CH32V_SDIO_RESP4_CARDSTATUS4_MASK (0xffffffff << 0)
#define CH32V_SDIO_DTIMER_OFFSET          0x0024
#define CH32V_SDIO_DTIMER                 (CH32V_SDIO_BASE + CH32V_SDIO_DTIMER_OFFSET) /* read-write */
#define CH32V_SDIO_DTIMER_DATATIME        (0xffffffff << 0) /* ffffffff: Data timeout period */
#define CH32V_SDIO_DTIMER_DATATIME_MASK   (0xffffffff << 0)
#define CH32V_SDIO_DLEN_OFFSET            0x0028
#define CH32V_SDIO_DLEN                   (CH32V_SDIO_BASE + CH32V_SDIO_DLEN_OFFSET) /* read-write */
#define CH32V_SDIO_DLEN_DATALENGTH        (0x1ffffff << 0) /* 01ffffff: Data length value */
#define CH32V_SDIO_DLEN_DATALENGTH_MASK   (0x1ffffff << 0)
#define CH32V_SDIO_DCTRL_OFFSET           0x002c
#define CH32V_SDIO_DCTRL                  (CH32V_SDIO_BASE + CH32V_SDIO_DCTRL_OFFSET) /* read-write */
#define CH32V_SDIO_DCTRL_DTEN             (1 <<  0) /* 00000001: Data transfer enabled bit */
#define CH32V_SDIO_DCTRL_DTDIR            (1 <<  1) /* 00000002: Data transfer direction selection */
#define CH32V_SDIO_DCTRL_DTMODE           (1 <<  2) /* 00000004: Data transfer mode selection 1: Stream or SDIO multibyte data transfer */
#define CH32V_SDIO_DCTRL_DMAEN            (1 <<  3) /* 00000008: DMA enable bit */
#define CH32V_SDIO_DCTRL_DBLOCKSIZE       (0xf << 4) /* 000000f0: Data block size */
#define CH32V_SDIO_DCTRL_DBLOCKSIZE_MASK  (0xf << 4)
#define CH32V_SDIO_DCTRL_PWSTART          (1 <<  8) /* 00000100: Read wait start */
#define CH32V_SDIO_DCTRL_PWSTOP           (1 <<  9) /* 00000200: Read wait stop */
#define CH32V_SDIO_DCTRL_RWMOD            (1 << 10) /* 00000400: Read wait mode */
#define CH32V_SDIO_DCTRL_SDIOEN           (1 << 11) /* 00000800: SD I/O enable functions */
#define CH32V_SDIO_DCOUNT_OFFSET          0x0030
#define CH32V_SDIO_DCOUNT                 (CH32V_SDIO_BASE + CH32V_SDIO_DCOUNT_OFFSET) /* read-only */
#define CH32V_SDIO_DCOUNT_DATACOUNT       (0x1ffffff << 0) /* 01ffffff: Data count value */
#define CH32V_SDIO_DCOUNT_DATACOUNT_MASK  (0x1ffffff << 0)
#define CH32V_SDIO_STA_OFFSET             0x0034
#define CH32V_SDIO_STA                    (CH32V_SDIO_BASE + CH32V_SDIO_STA_OFFSET) /* read-only */
#define CH32V_SDIO_STA_CCRCFAIL           (1 <<  0) /* 00000001: Command response received (CRC check failed) */
#define CH32V_SDIO_STA_DCRCFAIL           (1 <<  1) /* 00000002: Data block sent/received (CRC check failed) */
#define CH32V_SDIO_STA_CTIMEOUT           (1 <<  2) /* 00000004: Command response timeout */
#define CH32V_SDIO_STA_DTIMEOUT           (1 <<  3) /* 00000008: Data timeout */
#define CH32V_SDIO_STA_TXUNDERR           (1 <<  4) /* 00000010: Transmit FIFO underrun error */
#define CH32V_SDIO_STA_RXOVERR            (1 <<  5) /* 00000020: Received FIFO overrun error */
#define CH32V_SDIO_STA_CMDREND            (1 <<  6) /* 00000040: Command response received (CRC check passed) */
#define CH32V_SDIO_STA_CMDSENT            (1 <<  7) /* 00000080: Command sent (no response required) */
#define CH32V_SDIO_STA_DATAEND            (1 <<  8) /* 00000100: Data end (data counter, SDIDCOUNT, is zero) */
#define CH32V_SDIO_STA_STBITERR           (1 <<  9) /* 00000200: Start bit not detected on all data signals in wide bus mode */
#define CH32V_SDIO_STA_DBCKEND            (1 << 10) /* 00000400: Data block sent/received (CRC check passed) */
#define CH32V_SDIO_STA_CMDACT             (1 << 11) /* 00000800: Command transfer in progress */
#define CH32V_SDIO_STA_TXACT              (1 << 12) /* 00001000: Data transmit in progress */
#define CH32V_SDIO_STA_RXACT              (1 << 13) /* 00002000: Data receive in progress */
#define CH32V_SDIO_STA_TXFIFOHE           (1 << 14) /* 00004000: Transmit FIFO half empty: at least 8 words can be written into the FIFO */
#define CH32V_SDIO_STA_RXFIFOHF           (1 << 15) /* 00008000: Receive FIFO half full: there are at least 8 words in the FIFO */
#define CH32V_SDIO_STA_TXFIFOF            (1 << 16) /* 00010000: Transmit FIFO full */
#define CH32V_SDIO_STA_RXFIFOF            (1 << 17) /* 00020000: Receive FIFO full */
#define CH32V_SDIO_STA_TXFIFOE            (1 << 18) /* 00040000: Transmit FIFO empty */
#define CH32V_SDIO_STA_RXFIFOE            (1 << 19) /* 00080000: Receive FIFO empty */
#define CH32V_SDIO_STA_TXDAVL             (1 << 20) /* 00100000: Data available in transmit FIFO */
#define CH32V_SDIO_STA_RXDAVL             (1 << 21) /* 00200000: Data available in receive FIFO */
#define CH32V_SDIO_STA_SDIOIT             (1 << 22) /* 00400000: SDIO interrupt received */
#define CH32V_SDIO_STA_CEATAEND           (1 << 23) /* 00800000: CE-ATA command completion signal received for CMD61 */
#define CH32V_SDIO_ICR_OFFSET             0x0038
#define CH32V_SDIO_ICR                    (CH32V_SDIO_BASE + CH32V_SDIO_ICR_OFFSET) /* read-write */
#define CH32V_SDIO_ICR_CCRCFAILC          (1 <<  0) /* 00000001: CCRCFAIL flag clear bit */
#define CH32V_SDIO_ICR_DCRCFAILC          (1 <<  1) /* 00000002: DCRCFAIL flag clear bit */
#define CH32V_SDIO_ICR_CTIMEOUTC          (1 <<  2) /* 00000004: CTIMEOUT flag clear bit */
#define CH32V_SDIO_ICR_DTIMEOUTC          (1 <<  3) /* 00000008: DTIMEOUT flag clear bit */
#define CH32V_SDIO_ICR_TXUNDERRC          (1 <<  4) /* 00000010: TXUNDERR flag clear bit */
#define CH32V_SDIO_ICR_RXOVERRC           (1 <<  5) /* 00000020: RXOVERR flag clear bit */
#define CH32V_SDIO_ICR_CMDRENDC           (1 <<  6) /* 00000040: CMDREND flag clear bit */
#define CH32V_SDIO_ICR_CMDSENTC           (1 <<  7) /* 00000080: CMDSENT flag clear bit */
#define CH32V_SDIO_ICR_DATAENDC           (1 <<  8) /* 00000100: DATAEND flag clear bit */
#define CH32V_SDIO_ICR_STBITERRC          (1 <<  9) /* 00000200: STBITERR flag clear bit */
#define CH32V_SDIO_ICR_DBCKENDC           (1 << 10) /* 00000400: DBCKEND flag clear bit */
#define CH32V_SDIO_ICR_SDIOITC            (1 << 22) /* 00400000: SDIOIT flag clear bit */
#define CH32V_SDIO_ICR_CEATAENDC          (1 << 23) /* 00800000: CEATAEND flag clear bit */
#define CH32V_SDIO_MASK_OFFSET            0x003c
#define CH32V_SDIO_MASK                   (CH32V_SDIO_BASE + CH32V_SDIO_MASK_OFFSET) /* read-write */
#define CH32V_SDIO_MASK_CCRCFAILIE        (1 <<  0) /* 00000001: Command CRC fail interrupt enable */
#define CH32V_SDIO_MASK_DCRCFAILIE        (1 <<  1) /* 00000002: Data CRC fail interrupt enable */
#define CH32V_SDIO_MASK_CTIMEOUTIE        (1 <<  2) /* 00000004: Command timeout interrupt enable */
#define CH32V_SDIO_MASK_DTIMEOUTIE        (1 <<  3) /* 00000008: Data timeout interrupt enable */
#define CH32V_SDIO_MASK_TXUNDERRIE        (1 <<  4) /* 00000010: Tx FIFO underrun error interrupt enable */
#define CH32V_SDIO_MASK_RXOVERRIE         (1 <<  5) /* 00000020: Rx FIFO overrun error interrupt enable */
#define CH32V_SDIO_MASK_CMDRENDIE         (1 <<  6) /* 00000040: Command response received interrupt enable */
#define CH32V_SDIO_MASK_CMDSENTIE         (1 <<  7) /* 00000080: Command sent interrupt enable */
#define CH32V_SDIO_MASK_DATAENDIE         (1 <<  8) /* 00000100: Data end interrupt enable */
#define CH32V_SDIO_MASK_STBITERRIE        (1 <<  9) /* 00000200: Start bit error interrupt enable */
#define CH32V_SDIO_MASK_DBACKENDIE        (1 << 10) /* 00000400: Data block end interrupt enable */
#define CH32V_SDIO_MASK_CMDACTIE          (1 << 11) /* 00000800: Command acting interrupt enable */
#define CH32V_SDIO_MASK_TXACTIE           (1 << 12) /* 00001000: Data transmit acting interrupt enable */
#define CH32V_SDIO_MASK_RXACTIE           (1 << 13) /* 00002000: Data receive acting interrupt enable */
#define CH32V_SDIO_MASK_TXFIFOHEIE        (1 << 14) /* 00004000: Tx FIFO half empty interrupt enable */
#define CH32V_SDIO_MASK_RXFIFOHFIE        (1 << 15) /* 00008000: Rx FIFO half full interrupt enable */
#define CH32V_SDIO_MASK_TXFIFOFIE         (1 << 16) /* 00010000: Tx FIFO full interrupt enable */
#define CH32V_SDIO_MASK_RXFIFOFIE         (1 << 17) /* 00020000: Rx FIFO full interrupt enable */
#define CH32V_SDIO_MASK_TXFIFOEIE         (1 << 18) /* 00040000: Tx FIFO empty interrupt enable */
#define CH32V_SDIO_MASK_RXFIFOEIE         (1 << 19) /* 00080000: Rx FIFO empty interrupt enable */
#define CH32V_SDIO_MASK_TXDAVLIE          (1 << 20) /* 00100000: Data available in Tx FIFO interrupt enable */
#define CH32V_SDIO_MASK_RXDAVLIE          (1 << 21) /* 00200000: Data available in Rx FIFO interrupt enable */
#define CH32V_SDIO_MASK_SDIOITIE          (1 << 22) /* 00400000: SDIO mode interrupt received interrupt enable */
#define CH32V_SDIO_MASK_CEATENDIE         (1 << 23) /* 00800000: CE-ATA command completion signal received interrupt enable */
#define CH32V_SDIO_FIFOCNT_OFFSET         0x0048
#define CH32V_SDIO_FIFOCNT                (CH32V_SDIO_BASE + CH32V_SDIO_FIFOCNT_OFFSET) /* read-only */
#define CH32V_SDIO_FIFOCNT_FIF0COUNT      (0xffffffff << 0) /* ffffffff: Remaining number of words to be written to or read from the FIFO */
#define CH32V_SDIO_FIFOCNT_FIF0COUNT_MASK (0xffffffff << 0)
#define CH32V_SDIO_FIFO_OFFSET            0x0080
#define CH32V_SDIO_FIFO                   (CH32V_SDIO_BASE + CH32V_SDIO_FIFO_OFFSET) /* read-write */
#define CH32V_SDIO_FIFO_FIFOData          (0xffffffff << 0) /* ffffffff: Receive and transmit FIFO data */
#define CH32V_SDIO_FIFO_FIFOData_MASK     (0xffffffff << 0)

