robertlipe/svdtoheaders/demo/h/ch32v307_reg.h
/* FSMC - Flexible static memory controller */
#define CH32V_FSMC_BASE                   0xa0000000
#define CH32V_FSMC_BCR1_OFFSET            0x0000
#define CH32V_FSMC_BCR1                   (CH32V_FSMC_BASE + CH32V_FSMC_BCR1_OFFSET) /* read-write */
#define CH32V_FSMC_BCR1_CBURSTRW          (1 << 19) /* 00080000: Write burst enable */
#define CH32V_FSMC_BCR1_ASYNCWAIT         (1 << 15) /* 00008000: Wait signal during asynchronous transfers */
#define CH32V_FSMC_BCR1_EXTMOD            (1 << 14) /* 00004000: Extended mode enable */
#define CH32V_FSMC_BCR1_WAITEN            (1 << 13) /* 00002000: Wait enable bit */
#define CH32V_FSMC_BCR1_WREN              (1 << 12) /* 00001000: Write enable bit */
#define CH32V_FSMC_BCR1_WAITCFG           (1 << 11) /* 00000800: Wait timing configuration */
#define CH32V_FSMC_BCR1_WRAPMOD           (1 << 10) /* 00000400: Wrapped burst mode support */
#define CH32V_FSMC_BCR1_WAITPOL           (1 <<  9) /* 00000200: Wait signal polarity bit */
#define CH32V_FSMC_BCR1_BURSTEN           (1 <<  8) /* 00000100: Burst enable bit */
#define CH32V_FSMC_BCR1_FACCEN            (1 <<  6) /* 00000040: Flash access enable */
#define CH32V_FSMC_BCR1_MWID              (0x3 << 4) /* 00000030: Memory databus width */
#define CH32V_FSMC_BCR1_MWID_MASK         (0x3 << 4)
#define CH32V_FSMC_BCR1_MTYP              (0x3 << 2) /* 0000000c: Memory type */
#define CH32V_FSMC_BCR1_MTYP_MASK         (0x3 << 2)
#define CH32V_FSMC_BCR1_MUXEN             (1 <<  1) /* 00000002: Address/data multiplexing enable bit */
#define CH32V_FSMC_BCR1_MBKEN             (1 <<  0) /* 00000001: Memory bank enable bit */
#define CH32V_FSMC_BTR1_OFFSET            0x0004
#define CH32V_FSMC_BTR1                   (CH32V_FSMC_BASE + CH32V_FSMC_BTR1_OFFSET) /* read-write */
#define CH32V_FSMC_BTR1_ACCMOD            (0x3 << 28) /* 30000000: Access mode */
#define CH32V_FSMC_BTR1_ACCMOD_MASK       (0x3 << 28)
#define CH32V_FSMC_BTR1_DATLAT            (0xf << 24) /* 0f000000: Data latency for synchronous NOR Flash memory */
#define CH32V_FSMC_BTR1_DATLAT_MASK       (0xf << 24)
#define CH32V_FSMC_BTR1_CLKDIV            (0xf << 20) /* 00f00000: Clock divide ratio (for FSMC_CLK signal) */
#define CH32V_FSMC_BTR1_CLKDIV_MASK       (0xf << 20)
#define CH32V_FSMC_BTR1_BUSTURN           (0xf << 16) /* 000f0000: Bus turnaround phase duration */
#define CH32V_FSMC_BTR1_BUSTURN_MASK      (0xf << 16)
#define CH32V_FSMC_BTR1_DATAST            (0xff << 8) /* 0000ff00: Data-phase duration */
#define CH32V_FSMC_BTR1_DATAST_MASK       (0xff << 8)
#define CH32V_FSMC_BTR1_ADDHLD            (0xf << 4) /* 000000f0: Address-hold phase duration */
#define CH32V_FSMC_BTR1_ADDHLD_MASK       (0xf << 4)
#define CH32V_FSMC_BTR1_ADDSET            (0xf << 0) /* 0000000f: Address setup phase duration */
#define CH32V_FSMC_BTR1_ADDSET_MASK       (0xf << 0)
#define CH32V_FSMC_PCR2_OFFSET            0x0060
#define CH32V_FSMC_PCR2                   (CH32V_FSMC_BASE + CH32V_FSMC_PCR2_OFFSET) /* read-write */
#define CH32V_FSMC_PCR2_ECCPS             (0x7 << 17) /* 000e0000: ECC page size */
#define CH32V_FSMC_PCR2_ECCPS_MASK        (0x7 << 17)
#define CH32V_FSMC_PCR2_TAR               (0xf << 13) /* 0001e000: ALE to RE delay */
#define CH32V_FSMC_PCR2_TAR_MASK          (0xf << 13)
#define CH32V_FSMC_PCR2_TCLR              (0xf << 9) /* 00001e00: CLE to RE delay */
#define CH32V_FSMC_PCR2_TCLR_MASK         (0xf << 9)
#define CH32V_FSMC_PCR2_ECCEN             (1 <<  6) /* 00000040: ECC computation logic enable bit */
#define CH32V_FSMC_PCR2_PWID              (0x3 << 4) /* 00000030: Databus width */
#define CH32V_FSMC_PCR2_PWID_MASK         (0x3 << 4)
#define CH32V_FSMC_PCR2_PTYP              (1 <<  3) /* 00000008: Memory type */
#define CH32V_FSMC_PCR2_PBKEN             (1 <<  2) /* 00000004: PC Card/NAND Flash memory bank enable bit */
#define CH32V_FSMC_PCR2_PWAITEN           (1 <<  1) /* 00000002: Wait feature enable bit */
#define CH32V_FSMC_SR2_OFFSET             0x0064
#define CH32V_FSMC_SR2                    (CH32V_FSMC_BASE + CH32V_FSMC_SR2_OFFSET)
#define CH32V_FSMC_SR2_FEMPT              (1 <<  6) /* 00000040: FIFO empty */
#define CH32V_FSMC_SR2_IFEN               (1 <<  5) /* 00000020: Interrupt falling edge detection enable bit */
#define CH32V_FSMC_SR2_ILEN               (1 <<  4) /* 00000010: Interrupt high-level detection enable bit */
#define CH32V_FSMC_SR2_IREN               (1 <<  3) /* 00000008: Interrupt rising edge detection enable bit */
#define CH32V_FSMC_SR2_IFS                (1 <<  2) /* 00000004: Interrupt falling edge status */
#define CH32V_FSMC_SR2_ILS                (1 <<  1) /* 00000002: Interrupt high-level status */
#define CH32V_FSMC_SR2_IRS                (1 <<  0) /* 00000001: Interrupt rising edge status */
#define CH32V_FSMC_PMEM2_OFFSET           0x0068
#define CH32V_FSMC_PMEM2                  (CH32V_FSMC_BASE + CH32V_FSMC_PMEM2_OFFSET) /* read-write */
#define CH32V_FSMC_PMEM2_MEMHIZx          (0xff << 24) /* ff000000: Common memory x databus HiZ time */
#define CH32V_FSMC_PMEM2_MEMHIZx_MASK     (0xff << 24)
#define CH32V_FSMC_PMEM2_MEMHOLDx         (0xff << 16) /* 00ff0000: Common memory x hold time */
#define CH32V_FSMC_PMEM2_MEMHOLDx_MASK    (0xff << 16)
#define CH32V_FSMC_PMEM2_MEMWAITx         (0xff << 8) /* 0000ff00: Common memory x wait time */
#define CH32V_FSMC_PMEM2_MEMWAITx_MASK    (0xff << 8)
#define CH32V_FSMC_PMEM2_MEMSETx          (0xff << 0) /* 000000ff: Common memory x setup time */
#define CH32V_FSMC_PMEM2_MEMSETx_MASK     (0xff << 0)
#define CH32V_FSMC_PATT2_OFFSET           0x006c
#define CH32V_FSMC_PATT2                  (CH32V_FSMC_BASE + CH32V_FSMC_PATT2_OFFSET) /* read-write */
#define CH32V_FSMC_PATT2_ATTHIZx          (0xff << 24) /* ff000000: Attribute memory x databus HiZ time */
#define CH32V_FSMC_PATT2_ATTHIZx_MASK     (0xff << 24)
#define CH32V_FSMC_PATT2_ATTHOLDx         (0xff << 16) /* 00ff0000: Attribute memory x hold time */
#define CH32V_FSMC_PATT2_ATTHOLDx_MASK    (0xff << 16)
#define CH32V_FSMC_PATT2_ATTWAITx         (0xff << 8) /* 0000ff00: Attribute memory x wait time */
#define CH32V_FSMC_PATT2_ATTWAITx_MASK    (0xff << 8)
#define CH32V_FSMC_PATT2_ATTSETx          (0xff << 0) /* 000000ff: Attribute memory x setup time */
#define CH32V_FSMC_PATT2_ATTSETx_MASK     (0xff << 0)
#define CH32V_FSMC_ECCR2_OFFSET           0x0074
#define CH32V_FSMC_ECCR2                  (CH32V_FSMC_BASE + CH32V_FSMC_ECCR2_OFFSET) /* read-only */
#define CH32V_FSMC_ECCR2_ECCx             (0xffffffff << 0) /* ffffffff: ECC result */
#define CH32V_FSMC_ECCR2_ECCx_MASK        (0xffffffff << 0)
#define CH32V_FSMC_BWTR1_OFFSET           0x0104
#define CH32V_FSMC_BWTR1                  (CH32V_FSMC_BASE + CH32V_FSMC_BWTR1_OFFSET) /* read-write */
#define CH32V_FSMC_BWTR1_ACCMOD           (0x3 << 28) /* 30000000: Access mode */
#define CH32V_FSMC_BWTR1_ACCMOD_MASK      (0x3 << 28)
#define CH32V_FSMC_BWTR1_DATLAT           (0xf << 24) /* 0f000000: Data latency for synchronous NOR Flash memory */
#define CH32V_FSMC_BWTR1_DATLAT_MASK      (0xf << 24)
#define CH32V_FSMC_BWTR1_CLKDIV           (0xf << 20) /* 00f00000: Clock divide ratio (for FSMC_CLK signal) */
#define CH32V_FSMC_BWTR1_CLKDIV_MASK      (0xf << 20)
#define CH32V_FSMC_BWTR1_DATAST           (0xff << 8) /* 0000ff00: Data-phase duration */
#define CH32V_FSMC_BWTR1_DATAST_MASK      (0xff << 8)
#define CH32V_FSMC_BWTR1_ADDHLD           (0xf << 4) /* 000000f0: Address-hold phase duration */
#define CH32V_FSMC_BWTR1_ADDHLD_MASK      (0xf << 4)
#define CH32V_FSMC_BWTR1_ADDSET           (0xf << 0) /* 0000000f: Address setup phase duration */
#define CH32V_FSMC_BWTR1_ADDSET_MASK      (0xf << 0)

/* DVP - Digital Video Port */
#define CH32V_DVP_BASE                    0x50050000
#define CH32V_DVP_CR0_OFFSET              0x0000
#define CH32V_DVP_CR0                     (CH32V_DVP_BASE + CH32V_DVP_CR0_OFFSET) /* read-write */
#define CH32V_DVP_CR0_RB_DVP_ENABLE       (1 <<  0) /* 00000001: DVP enable */
#define CH32V_DVP_CR0_RB_DVP_V_POLAR      (1 <<  1) /* 00000002: DVP VSYNC polarity control */
#define CH32V_DVP_CR0_RB_DVP_H_POLAR      (1 <<  2) /* 00000004: DVP HSYNC polarity control */
#define CH32V_DVP_CR0_RB_DVP_P_POLAR      (1 <<  3) /* 00000008: DVP PCLK polarity control */
#define CH32V_DVP_CR0_RB_DVP_MSK_DAT_MOD  (0x3 << 4) /* 00000030: DVP data mode */
#define CH32V_DVP_CR0_RB_DVP_MSK_DAT_MOD_MASK (0x3 << 4)
#define CH32V_DVP_CR0_RB_DVP_JPEG         (1 <<  6) /* 00000040: DVP JPEG mode */
#define CH32V_DVP_CR1_OFFSET              0x0001
#define CH32V_DVP_CR1                     (CH32V_DVP_BASE + CH32V_DVP_CR1_OFFSET) /* read-write */
#define CH32V_DVP_CR1_RB_DVP_DMA_EN       (1 <<  0) /* 00000001: DVP dma enable */
#define CH32V_DVP_CR1_RB_DVP_ALL_CLR      (1 <<  1) /* 00000002: DVP all clear */
#define CH32V_DVP_CR1_RB_DVP_RCV_CLR      (1 <<  2) /* 00000004: DVP receive logic clear */
#define CH32V_DVP_CR1_RB_DVP_BUF_TOG      (1 <<  3) /* 00000008: DVP bug toggle by software */
#define CH32V_DVP_CR1_RB_DVP_CM           (1 <<  4) /* 00000010: DVP capture mode */
#define CH32V_DVP_CR1_RB_DVP_CROP         (1 <<  5) /* 00000020: DVP Crop feature enable */
#define CH32V_DVP_CR1_RB_DVP_FCRC         (0x3 << 6) /* 000000c0: DVP frame capture rate control */
#define CH32V_DVP_CR1_RB_DVP_FCRC_MASK    (0x3 << 6)
#define CH32V_DVP_IER_OFFSET              0x0002
#define CH32V_DVP_IER                     (CH32V_DVP_BASE + CH32V_DVP_IER_OFFSET) /* read-write */
#define CH32V_DVP_IER_RB_DVP_IE_STR_FRM   (1 <<  0) /* 00000001: DVP frame start interrupt enable */
#define CH32V_DVP_IER_RB_DVP_IE_ROW_DONE  (1 <<  1) /* 00000002: DVP row received done interrupt enable */
#define CH32V_DVP_IER_RB_DVP_IE_FRM_DONE  (1 <<  2) /* 00000004: DVP frame received done interrupt enable */
#define CH32V_DVP_IER_RB_DVP_IE_FIFO_OV   (1 <<  3) /* 00000008: DVP receive fifo overflow interrupt enable */
#define CH32V_DVP_IER_RB_DVP_IE_STP_FRM   (1 <<  4) /* 00000010: DVP frame stop interrupt enable */
#define CH32V_DVP_ROW_NUM_OFFSET          0x0004
#define CH32V_DVP_ROW_NUM                 (CH32V_DVP_BASE + CH32V_DVP_ROW_NUM_OFFSET) /* read-write */
#define CH32V_DVP_ROW_NUM_RB_DVP_ROW_NUM  (0xffff << 0) /* 0000ffff: The number of rows of frame image data */
#define CH32V_DVP_ROW_NUM_RB_DVP_ROW_NUM_MASK (0xffff << 0)
#define CH32V_DVP_COL_NUM_OFFSET          0x0006
#define CH32V_DVP_COL_NUM                 (CH32V_DVP_BASE + CH32V_DVP_COL_NUM_OFFSET) /* read-write */
#define CH32V_DVP_COL_NUM_RB_DVP_COL_NUM  (0xffff << 0) /* 0000ffff: Number of PCLK cycles for row data */
#define CH32V_DVP_COL_NUM_RB_DVP_COL_NUM_MASK (0xffff << 0)
#define CH32V_DVP_DMA_BUF0_OFFSET         0x0008
#define CH32V_DVP_DMA_BUF0                (CH32V_DVP_BASE + CH32V_DVP_DMA_BUF0_OFFSET) /* read-write */
#define CH32V_DVP_DMA_BUF0_RB_DVP_DMA_BUF0 (0x1ffff << 0) /* 0001ffff: DMA receive address 0 */
#define CH32V_DVP_DMA_BUF0_RB_DVP_DMA_BUF0_MASK (0x1ffff << 0)
#define CH32V_DVP_DMA_BUF1_OFFSET         0x000c
#define CH32V_DVP_DMA_BUF1                (CH32V_DVP_BASE + CH32V_DVP_DMA_BUF1_OFFSET) /* read-write */
#define CH32V_DVP_DMA_BUF1_RB_DVP_DMA_BUF1 (0x1ffff << 0) /* 0001ffff: DMA receive address 1 */
#define CH32V_DVP_DMA_BUF1_RB_DVP_DMA_BUF1_MASK (0x1ffff << 0)
#define CH32V_DVP_IFR_OFFSET              0x0010
#define CH32V_DVP_IFR                     (CH32V_DVP_BASE + CH32V_DVP_IFR_OFFSET) /* read-write */
#define CH32V_DVP_IFR_RB_DVP_IF_STR_FRM   (1 <<  0) /* 00000001: DVP frame start interrupt enable */
#define CH32V_DVP_IFR_RB_DVP_IF_ROW_DONE  (1 <<  1) /* 00000002: DVP row received done interrupt enable */
#define CH32V_DVP_IFR_RB_DVP_IF_FRM_DONE  (1 <<  2) /* 00000004: DVP frame received done interrupt enable */
#define CH32V_DVP_IFR_RB_DVP_IF_FIFO_OV   (1 <<  3) /* 00000008: DVP receive fifo overflow interrupt enable */
#define CH32V_DVP_IFR_RB_DVP_IF_STP_FRM   (1 <<  4) /* 00000010: DVP frame stop interrupt enable */
#define CH32V_DVP_STATUS_OFFSET           0x0011
#define CH32V_DVP_STATUS                  (CH32V_DVP_BASE + CH32V_DVP_STATUS_OFFSET) /* read-only */
#define CH32V_DVP_STATUS_RB_DVP_FIFO_RDY  (1 <<  0) /* 00000001: DVP frame start interrupt enable */
#define CH32V_DVP_STATUS_RB_DVP_FIFO_FULL (1 <<  1) /* 00000002: DVP row received done interrupt enable */
#define CH32V_DVP_STATUS_RB_DVP_FIFO_OV   (1 <<  2) /* 00000004: DVP frame received done interrupt enable */
#define CH32V_DVP_STATUS_RB_DVP_MSK_FIFO_CNT (0x7 << 4) /* 00000070: DVP receive fifo overflow interrupt enable */
#define CH32V_DVP_STATUS_RB_DVP_MSK_FIFO_CNT_MASK (0x7 << 4)
#define CH32V_DVP_ROW_CNT_OFFSET          0x0014
#define CH32V_DVP_ROW_CNT                 (CH32V_DVP_BASE + CH32V_DVP_ROW_CNT_OFFSET) /* read-only */
#define CH32V_DVP_ROW_CNT_RB_DVP_ROW_CNT  (0xffff << 0) /* 0000ffff: The number of rows of frame image data */
#define CH32V_DVP_ROW_CNT_RB_DVP_ROW_CNT_MASK (0xffff << 0)
#define CH32V_DVP_HOFFCNT_OFFSET          0x0018
#define CH32V_DVP_HOFFCNT                 (CH32V_DVP_BASE + CH32V_DVP_HOFFCNT_OFFSET) /* read-write */
#define CH32V_DVP_HOFFCNT_RB_DVP_HOFFCNT  (0xffff << 0) /* 0000ffff: Number of PCLK cycles for row data */
#define CH32V_DVP_HOFFCNT_RB_DVP_HOFFCNT_MASK (0xffff << 0)
#define CH32V_DVP_VST_OFFSET              0x001a
#define CH32V_DVP_VST                     (CH32V_DVP_BASE + CH32V_DVP_VST_OFFSET) /* read-write */
#define CH32V_DVP_VST_RB_DVP_VST          (0xffff << 0) /* 0000ffff: The number of lines captured by the image */
#define CH32V_DVP_VST_RB_DVP_VST_MASK     (0xffff << 0)
#define CH32V_DVP_CAPCNT_OFFSET           0x001c
#define CH32V_DVP_CAPCNT                  (CH32V_DVP_BASE + CH32V_DVP_CAPCNT_OFFSET) /* read-write */
#define CH32V_DVP_CAPCNT_RB_DVP_CAPCNT    (0xffff << 0) /* 0000ffff: Number of PCLK cycles captured by clipping window */
#define CH32V_DVP_CAPCNT_RB_DVP_CAPCNT_MASK (0xffff << 0)
#define CH32V_DVP_VLINE_OFFSET            0x001e
#define CH32V_DVP_VLINE                   (CH32V_DVP_BASE + CH32V_DVP_VLINE_OFFSET) /* read-write */
#define CH32V_DVP_VLINE_RB_DVP_VLINE      (0xffff << 0) /* 0000ffff: Crop the number of rows captured by window */
#define CH32V_DVP_VLINE_RB_DVP_VLINE_MASK (0xffff << 0)
#define CH32V_DVP_DR_OFFSET               0x0020
#define CH32V_DVP_DR                      (CH32V_DVP_BASE + CH32V_DVP_DR_OFFSET) /* read-only */
#define CH32V_DVP_DR_RB_DVP_DR            (0xffffffff << 0) /* ffffffff: Prevent DMA overflow */
#define CH32V_DVP_DR_RB_DVP_DR_MASK       (0xffffffff << 0)

/* DAC - Digital to analog converter */
#define CH32V_DAC_BASE                    0x40007400
#define CH32V_DAC_CTLR_OFFSET             0x0000
#define CH32V_DAC_CTLR                    (CH32V_DAC_BASE + CH32V_DAC_CTLR_OFFSET) /* read-write */
#define CH32V_DAC_CTLR_EN1                (1 <<  0) /* 00000001: DAC channel1 enable */
#define CH32V_DAC_CTLR_BOFF1              (1 <<  1) /* 00000002: DAC channel1 output buffer disable */
#define CH32V_DAC_CTLR_TEN1               (1 <<  2) /* 00000004: DAC channel1 trigger enable */
#define CH32V_DAC_CTLR_TSEL1              (0x7 << 3) /* 00000038: DAC channel1 trigger selection */
#define CH32V_DAC_CTLR_TSEL1_MASK         (0x7 << 3)
#define CH32V_DAC_CTLR_WAVE1              (0x3 << 6) /* 000000c0: DAC channel1 noise/triangle wave generation enable */
#define CH32V_DAC_CTLR_WAVE1_MASK         (0x3 << 6)
#define CH32V_DAC_CTLR_MAMP1              (0xf << 8) /* 00000f00: DAC channel1 mask/amplitude selector */
#define CH32V_DAC_CTLR_MAMP1_MASK         (0xf << 8)
#define CH32V_DAC_CTLR_DMAEN1             (1 << 12) /* 00001000: DAC channel1 DMA enable */
#define CH32V_DAC_CTLR_EN2                (1 << 16) /* 00010000: DAC channel2 enable */
#define CH32V_DAC_CTLR_BOFF2              (1 << 17) /* 00020000: DAC channel2 output buffer disable */
#define CH32V_DAC_CTLR_TEN2               (1 << 18) /* 00040000: DAC channel2 trigger enable */
#define CH32V_DAC_CTLR_TSEL2              (0x7 << 19) /* 00380000: DAC channel2 trigger selection */
#define CH32V_DAC_CTLR_TSEL2_MASK         (0x7 << 19)
#define CH32V_DAC_CTLR_WAVE2              (0x3 << 22) /* 00c00000: DAC channel2 noise/triangle wave generation enable */
#define CH32V_DAC_CTLR_WAVE2_MASK         (0x3 << 22)
#define CH32V_DAC_CTLR_MAMP2              (0xf << 24) /* 0f000000: DAC channel2 mask/amplitude selector */
#define CH32V_DAC_CTLR_MAMP2_MASK         (0xf << 24)
#define CH32V_DAC_CTLR_DMAEN2             (1 << 28) /* 10000000: DAC channel2 DMA enable */
#define CH32V_DAC_SWTR_OFFSET             0x0004
#define CH32V_DAC_SWTR                    (CH32V_DAC_BASE + CH32V_DAC_SWTR_OFFSET) /* write-only */
#define CH32V_DAC_SWTR_SWTRIG1            (1 <<  0) /* 00000001: DAC channel1 software trigger */
#define CH32V_DAC_SWTR_SWTRIG2            (1 <<  1) /* 00000002: DAC channel2 software trigger */
#define CH32V_DAC_R12BDHR1_OFFSET         0x0008
#define CH32V_DAC_R12BDHR1                (CH32V_DAC_BASE + CH32V_DAC_R12BDHR1_OFFSET) /* read-write */
#define CH32V_DAC_R12BDHR1_DACC1DHR       (0xfff << 0) /* 00000fff: DAC channel1 12-bit right-aligned data */
#define CH32V_DAC_R12BDHR1_DACC1DHR_MASK  (0xfff << 0)
#define CH32V_DAC_L12BDHR1_OFFSET         0x000c
#define CH32V_DAC_L12BDHR1                (CH32V_DAC_BASE + CH32V_DAC_L12BDHR1_OFFSET) /* read-write */
#define CH32V_DAC_L12BDHR1_DACC1DHR       (0xfff << 4) /* 0000fff0: DAC channel1 12-bit left-aligned data */
#define CH32V_DAC_L12BDHR1_DACC1DHR_MASK  (0xfff << 4)
#define CH32V_DAC_R8BDHR1_OFFSET          0x0010
#define CH32V_DAC_R8BDHR1                 (CH32V_DAC_BASE + CH32V_DAC_R8BDHR1_OFFSET) /* read-write */
#define CH32V_DAC_R8BDHR1_DACC1DHR        (0xff << 0) /* 000000ff: DAC channel1 8-bit right-aligned data */
#define CH32V_DAC_R8BDHR1_DACC1DHR_MASK   (0xff << 0)
#define CH32V_DAC_R12BDHR2_OFFSET         0x0014
#define CH32V_DAC_R12BDHR2                (CH32V_DAC_BASE + CH32V_DAC_R12BDHR2_OFFSET) /* read-write */
#define CH32V_DAC_R12BDHR2_DACC2DHR       (0xfff << 0) /* 00000fff: DAC channel2 12-bit right-aligned data */
#define CH32V_DAC_R12BDHR2_DACC2DHR_MASK  (0xfff << 0)
#define CH32V_DAC_L12BDHR2_OFFSET         0x0018
#define CH32V_DAC_L12BDHR2                (CH32V_DAC_BASE + CH32V_DAC_L12BDHR2_OFFSET) /* read-write */
#define CH32V_DAC_L12BDHR2_DACC2DHR       (0xfff << 4) /* 0000fff0: DAC channel2 12-bit left-aligned data */
#define CH32V_DAC_L12BDHR2_DACC2DHR_MASK  (0xfff << 4)
#define CH32V_DAC_R8BDHR2_OFFSET          0x001c
#define CH32V_DAC_R8BDHR2                 (CH32V_DAC_BASE + CH32V_DAC_R8BDHR2_OFFSET) /* read-write */
#define CH32V_DAC_R8BDHR2_DACC2DHR        (0xff << 0) /* 000000ff: DAC channel2 8-bit right-aligned data */
#define CH32V_DAC_R8BDHR2_DACC2DHR_MASK   (0xff << 0)
#define CH32V_DAC_RD12BDHR_OFFSET         0x0020
#define CH32V_DAC_RD12BDHR                (CH32V_DAC_BASE + CH32V_DAC_RD12BDHR_OFFSET) /* read-write */
#define CH32V_DAC_RD12BDHR_DACC1DHR       (0xfff << 0) /* 00000fff: DAC channel1 12-bit right-aligned data */
#define CH32V_DAC_RD12BDHR_DACC1DHR_MASK  (0xfff << 0)
#define CH32V_DAC_RD12BDHR_DACC2DHR       (0xfff << 16) /* 0fff0000: DAC channel2 12-bit right-aligned data */
#define CH32V_DAC_RD12BDHR_DACC2DHR_MASK  (0xfff << 16)
#define CH32V_DAC_LD12BDHR_OFFSET         0x0024
#define CH32V_DAC_LD12BDHR                (CH32V_DAC_BASE + CH32V_DAC_LD12BDHR_OFFSET) /* read-write */
#define CH32V_DAC_LD12BDHR_DACC1DHR       (0xfff << 4) /* 0000fff0: DAC channel1 12-bit left-aligned data */
#define CH32V_DAC_LD12BDHR_DACC1DHR_MASK  (0xfff << 4)
#define CH32V_DAC_LD12BDHR_DACC2DHR       (0xfff << 20) /* fff00000: DAC channel2 12-bit right-aligned data */
#define CH32V_DAC_LD12BDHR_DACC2DHR_MASK  (0xfff << 20)
#define CH32V_DAC_RD8BDHR_OFFSET          0x0028
#define CH32V_DAC_RD8BDHR                 (CH32V_DAC_BASE + CH32V_DAC_RD8BDHR_OFFSET) /* read-write */
#define CH32V_DAC_RD8BDHR_DACC1DHR        (0xff << 0) /* 000000ff: DAC channel1 8-bit right-aligned data */
#define CH32V_DAC_RD8BDHR_DACC1DHR_MASK   (0xff << 0)
#define CH32V_DAC_RD8BDHR_DACC2DHR        (0xff << 8) /* 0000ff00: DAC channel2 8-bit right-aligned data */
#define CH32V_DAC_RD8BDHR_DACC2DHR_MASK   (0xff << 8)
#define CH32V_DAC_DOR1_OFFSET             0x002c
#define CH32V_DAC_DOR1                    (CH32V_DAC_BASE + CH32V_DAC_DOR1_OFFSET) /* read-only */
#define CH32V_DAC_DOR1_DACC1DOR           (0xfff << 0) /* 00000fff: DAC channel1 data output */
#define CH32V_DAC_DOR1_DACC1DOR_MASK      (0xfff << 0)
#define CH32V_DAC_DOR2_OFFSET             0x0030
#define CH32V_DAC_DOR2                    (CH32V_DAC_BASE + CH32V_DAC_DOR2_OFFSET) /* read-only */
#define CH32V_DAC_DOR2_DACC2DOR           (0xfff << 0) /* 00000fff: DAC channel2 data output */
#define CH32V_DAC_DOR2_DACC2DOR_MASK      (0xfff << 0)

/* PWR - Power control */
#define CH32V_PWR_BASE                    0x40007000
#define CH32V_PWR_CTLR_OFFSET             0x0000
#define CH32V_PWR_CTLR                    (CH32V_PWR_BASE + CH32V_PWR_CTLR_OFFSET) /* read-write */
#define CH32V_PWR_CTLR_LPDS               (1 <<  0) /* 00000001: Low Power Deep Sleep */
#define CH32V_PWR_CTLR_PDDS               (1 <<  1) /* 00000002: Power Down Deep Sleep */
#define CH32V_PWR_CTLR_CWUF               (1 <<  2) /* 00000004: Clear Wake-up Flag */
#define CH32V_PWR_CTLR_CSBF               (1 <<  3) /* 00000008: Clear STANDBY Flag */
#define CH32V_PWR_CTLR_PVDE               (1 <<  4) /* 00000010: Power Voltage Detector Enable */
#define CH32V_PWR_CTLR_PLS                (0x7 << 5) /* 000000e0: PVD Level Selection */
#define CH32V_PWR_CTLR_PLS_MASK           (0x7 << 5)
#define CH32V_PWR_CTLR_DBP                (1 <<  8) /* 00000100: Disable Backup Domain write protection */
#define CH32V_PWR_CTLR_R2K_STYEN          (1 << 16) /* 00010000: standby 2k ram enable */
#define CH32V_PWR_CTLR_R30K_STYEN         (1 << 17) /* 00020000: standby 30k ram enable */
#define CH32V_PWR_CTLR_R2K_VBATEN         (1 << 18) /* 00040000: VBAT 30k ram enable */
#define CH32V_PWR_CTLR_R30K_VBATEN        (1 << 19) /* 00080000: VBAT 30k ram enable */
#define CH32V_PWR_CTLR_RAM_LVEN           (1 << 20) /* 00100000: Ram LV Enable */
#define CH32V_PWR_CSR_OFFSET              0x0004
#define CH32V_PWR_CSR                     (CH32V_PWR_BASE + CH32V_PWR_CSR_OFFSET)
#define CH32V_PWR_CSR_WUF                 (1 <<  0) /* 00000001: Wake-Up Flag */
#define CH32V_PWR_CSR_SBF                 (1 <<  1) /* 00000002: STANDBY Flag */
#define CH32V_PWR_CSR_PVDO                (1 <<  2) /* 00000004: PVD Output */
#define CH32V_PWR_CSR_EWUP                (1 <<  8) /* 00000100: Enable WKUP pin */

