robertlipe/svdtoheaders/demo/h/ch32v307_reg.h
#define CH32V_DMA2_CNTR8_NDT_MASK         (0xffff << 0)
#define CH32V_DMA2_PADDR8_OFFSET          0x0098
#define CH32V_DMA2_PADDR8                 (CH32V_DMA2_BASE + CH32V_DMA2_PADDR8_OFFSET) /* read-write */
#define CH32V_DMA2_PADDR8_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA2_PADDR8_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA2_MADDR8_OFFSET          0x009c
#define CH32V_DMA2_MADDR8                 (CH32V_DMA2_BASE + CH32V_DMA2_MADDR8_OFFSET) /* read-write */
#define CH32V_DMA2_MADDR8_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA2_MADDR8_MA_MASK         (0xffffffff << 0)
#define CH32V_DMA2_CFGR9_OFFSET           0x00a0
#define CH32V_DMA2_CFGR9                  (CH32V_DMA2_BASE + CH32V_DMA2_CFGR9_OFFSET) /* read-write */
#define CH32V_DMA2_CFGR9_EN               (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA2_CFGR9_TCIE             (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA2_CFGR9_HTIE             (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA2_CFGR9_TEIE             (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA2_CFGR9_DIR              (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA2_CFGR9_CIRC             (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA2_CFGR9_PINC             (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA2_CFGR9_MINC             (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA2_CFGR9_PSIZE            (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA2_CFGR9_PSIZE_MASK       (0x3 << 8)
#define CH32V_DMA2_CFGR9_MSIZE            (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA2_CFGR9_MSIZE_MASK       (0x3 << 10)
#define CH32V_DMA2_CFGR9_PL               (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA2_CFGR9_PL_MASK          (0x3 << 12)
#define CH32V_DMA2_CFGR9_MEM2MEM          (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA2_CNTR9_OFFSET           0x00a4
#define CH32V_DMA2_CNTR9                  (CH32V_DMA2_BASE + CH32V_DMA2_CNTR9_OFFSET) /* read-write */
#define CH32V_DMA2_CNTR9_NDT              (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA2_CNTR9_NDT_MASK         (0xffff << 0)
#define CH32V_DMA2_PADDR9_OFFSET          0x00a8
#define CH32V_DMA2_PADDR9                 (CH32V_DMA2_BASE + CH32V_DMA2_PADDR9_OFFSET) /* read-write */
#define CH32V_DMA2_PADDR9_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA2_PADDR9_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA2_MADDR9_OFFSET          0x00ac
#define CH32V_DMA2_MADDR9                 (CH32V_DMA2_BASE + CH32V_DMA2_MADDR9_OFFSET) /* read-write */
#define CH32V_DMA2_MADDR9_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA2_MADDR9_MA_MASK         (0xffffffff << 0)
#define CH32V_DMA2_CFGR10_OFFSET          0x00b0
#define CH32V_DMA2_CFGR10                 (CH32V_DMA2_BASE + CH32V_DMA2_CFGR10_OFFSET) /* read-write */
#define CH32V_DMA2_CFGR10_EN              (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA2_CFGR10_TCIE            (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA2_CFGR10_HTIE            (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA2_CFGR10_TEIE            (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA2_CFGR10_DIR             (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA2_CFGR10_CIRC            (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA2_CFGR10_PINC            (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA2_CFGR10_MINC            (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA2_CFGR10_PSIZE           (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA2_CFGR10_PSIZE_MASK      (0x3 << 8)
#define CH32V_DMA2_CFGR10_MSIZE           (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA2_CFGR10_MSIZE_MASK      (0x3 << 10)
#define CH32V_DMA2_CFGR10_PL              (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA2_CFGR10_PL_MASK         (0x3 << 12)
#define CH32V_DMA2_CFGR10_MEM2MEM         (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA2_CNTR10_OFFSET          0x00b4
#define CH32V_DMA2_CNTR10                 (CH32V_DMA2_BASE + CH32V_DMA2_CNTR10_OFFSET) /* read-write */
#define CH32V_DMA2_CNTR10_NDT             (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA2_CNTR10_NDT_MASK        (0xffff << 0)
#define CH32V_DMA2_PADDR10_OFFSET         0x00b8
#define CH32V_DMA2_PADDR10                (CH32V_DMA2_BASE + CH32V_DMA2_PADDR10_OFFSET) /* read-write */
#define CH32V_DMA2_PADDR10_PA             (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA2_PADDR10_PA_MASK        (0xffffffff << 0)
#define CH32V_DMA2_MADDR10_OFFSET         0x00bc
#define CH32V_DMA2_MADDR10                (CH32V_DMA2_BASE + CH32V_DMA2_MADDR10_OFFSET) /* read-write */
#define CH32V_DMA2_MADDR10_MA             (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA2_MADDR10_MA_MASK        (0xffffffff << 0)
#define CH32V_DMA2_CFGR11_OFFSET          0x00c0
#define CH32V_DMA2_CFGR11                 (CH32V_DMA2_BASE + CH32V_DMA2_CFGR11_OFFSET) /* read-write */
#define CH32V_DMA2_CFGR11_EN              (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA2_CFGR11_TCIE            (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA2_CFGR11_HTIE            (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA2_CFGR11_TEIE            (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA2_CFGR11_DIR             (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA2_CFGR11_CIRC            (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA2_CFGR11_PINC            (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA2_CFGR11_MINC            (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA2_CFGR11_PSIZE           (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA2_CFGR11_PSIZE_MASK      (0x3 << 8)
#define CH32V_DMA2_CFGR11_MSIZE           (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA2_CFGR11_MSIZE_MASK      (0x3 << 10)
#define CH32V_DMA2_CFGR11_PL              (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA2_CFGR11_PL_MASK         (0x3 << 12)
#define CH32V_DMA2_CFGR11_MEM2MEM         (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA2_CNTR11_OFFSET          0x00c4
#define CH32V_DMA2_CNTR11                 (CH32V_DMA2_BASE + CH32V_DMA2_CNTR11_OFFSET) /* read-write */
#define CH32V_DMA2_CNTR11_NDT             (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA2_CNTR11_NDT_MASK        (0xffff << 0)
#define CH32V_DMA2_PADDR11_OFFSET         0x00c8
#define CH32V_DMA2_PADDR11                (CH32V_DMA2_BASE + CH32V_DMA2_PADDR11_OFFSET) /* read-write */
#define CH32V_DMA2_PADDR11_PA             (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA2_PADDR11_PA_MASK        (0xffffffff << 0)
#define CH32V_DMA2_MADDR11_OFFSET         0x00cc
#define CH32V_DMA2_MADDR11                (CH32V_DMA2_BASE + CH32V_DMA2_MADDR11_OFFSET) /* read-write */
#define CH32V_DMA2_MADDR11_MA             (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA2_MADDR11_MA_MASK        (0xffffffff << 0)
#define CH32V_DMA2_EXTEN_INTFR_OFFSET     0x00d0
#define CH32V_DMA2_EXTEN_INTFR            (CH32V_DMA2_BASE + CH32V_DMA2_EXTEN_INTFR_OFFSET) /* read-only */
#define CH32V_DMA2_EXTEN_INTFR_GIF8       (1 <<  0) /* 00000001: Channel 8 Global interrupt flag */
#define CH32V_DMA2_EXTEN_INTFR_TCIF8      (1 <<  1) /* 00000002: Channel 8 Transfer Complete flag */
#define CH32V_DMA2_EXTEN_INTFR_HTIF8      (1 <<  2) /* 00000004: Channel 8 Half Transfer Complete flag */
#define CH32V_DMA2_EXTEN_INTFR_TEIF8      (1 <<  3) /* 00000008: Channel 8 Transfer Error flag */
#define CH32V_DMA2_EXTEN_INTFR_GIF9       (1 <<  4) /* 00000010: Channel 9 Global interrupt flag */
#define CH32V_DMA2_EXTEN_INTFR_TCIF9      (1 <<  5) /* 00000020: Channel 9 Transfer Complete flag */
#define CH32V_DMA2_EXTEN_INTFR_HTIF9      (1 <<  6) /* 00000040: Channel 9 Half Transfer Complete flag */
#define CH32V_DMA2_EXTEN_INTFR_TEIF9      (1 <<  7) /* 00000080: Channel 9 Transfer Error flag */
#define CH32V_DMA2_EXTEN_INTFR_GIF10      (1 <<  8) /* 00000100: Channel 10 Global interrupt flag */
#define CH32V_DMA2_EXTEN_INTFR_TCIF10     (1 <<  9) /* 00000200: Channel 10 Transfer Complete flag */
#define CH32V_DMA2_EXTEN_INTFR_HTIF10     (1 << 10) /* 00000400: Channel 10 Half Transfer Complete flag */
#define CH32V_DMA2_EXTEN_INTFR_TEIF10     (1 << 11) /* 00000800: Channel 10 Transfer Error flag */
#define CH32V_DMA2_EXTEN_INTFR_GIF11      (1 << 12) /* 00001000: Channel 11 Global interrupt flag */
#define CH32V_DMA2_EXTEN_INTFR_TCIF11     (1 << 13) /* 00002000: Channel 11 Transfer Complete flag */
#define CH32V_DMA2_EXTEN_INTFR_HTIF11     (1 << 14) /* 00004000: Channel 11 Half Transfer Complete flag */
#define CH32V_DMA2_EXTEN_INTFR_TEIF11     (1 << 15) /* 00008000: Channel 11 Transfer Error flag */
#define CH32V_DMA2_EXTEN_INTFCR_OFFSET    0x00d4
#define CH32V_DMA2_EXTEN_INTFCR           (CH32V_DMA2_BASE + CH32V_DMA2_EXTEN_INTFCR_OFFSET) /* read-write */
#define CH32V_DMA2_EXTEN_INTFCR_CGIF8     (1 <<  0) /* 00000001: Channel 8 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CGIF9     (1 <<  4) /* 00000010: Channel 9 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CGIF10    (1 <<  8) /* 00000100: Channel 10 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CGIF11    (1 << 12) /* 00001000: Channel 11 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CTCIF8    (1 <<  1) /* 00000002: Channel 8 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CTCIF9    (1 <<  5) /* 00000020: Channel 9 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CTCIF10   (1 <<  9) /* 00000200: Channel 10 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CTCIF11   (1 << 13) /* 00002000: Channel 11 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CHTIF8    (1 <<  2) /* 00000004: Channel 8 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CHTIF9    (1 <<  6) /* 00000040: Channel 9 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CHTIF10   (1 << 10) /* 00000400: Channel 10 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CHTIF11   (1 << 14) /* 00004000: Channel 11 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CTEIF8    (1 <<  3) /* 00000008: Channel 8 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CTEIF9    (1 <<  7) /* 00000080: Channel 9 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CTEIF10   (1 << 11) /* 00000800: Channel 10 Global interrupt clear */
#define CH32V_DMA2_EXTEN_INTFCR_CTEIF11   (1 << 15) /* 00008000: Channel 11 Global interrupt clear */

/* RTC - Real time clock */
#define CH32V_RTC_BASE                    0x40002800
#define CH32V_RTC_CTLRH_OFFSET            0x0000
#define CH32V_RTC_CTLRH                   (CH32V_RTC_BASE + CH32V_RTC_CTLRH_OFFSET) /* read-write */
#define CH32V_RTC_CTLRH_SECIE             (1 <<  0) /* 00000001: Second interrupt Enable */
#define CH32V_RTC_CTLRH_ALRIE             (1 <<  1) /* 00000002: Alarm interrupt Enable */
#define CH32V_RTC_CTLRH_OWIE              (1 <<  2) /* 00000004: Overflow interrupt Enable */
#define CH32V_RTC_CTLRL_OFFSET            0x0004
#define CH32V_RTC_CTLRL                   (CH32V_RTC_BASE + CH32V_RTC_CTLRL_OFFSET)
#define CH32V_RTC_CTLRL_SECF              (1 <<  0) /* 00000001: Second Flag */
#define CH32V_RTC_CTLRL_ALRF              (1 <<  1) /* 00000002: Alarm Flag */
#define CH32V_RTC_CTLRL_OWF               (1 <<  2) /* 00000004: Overflow Flag */
#define CH32V_RTC_CTLRL_RSF               (1 <<  3) /* 00000008: Registers Synchronized Flag */
#define CH32V_RTC_CTLRL_CNF               (1 <<  4) /* 00000010: Configuration Flag */
#define CH32V_RTC_CTLRL_RTOFF             (1 <<  5) /* 00000020: RTC operation OFF */
#define CH32V_RTC_PSCRH_OFFSET            0x0008
#define CH32V_RTC_PSCRH                   (CH32V_RTC_BASE + CH32V_RTC_PSCRH_OFFSET) /* write-only */
#define CH32V_RTC_PSCRH_PRLH              (0xf << 0) /* 0000000f: RTC Prescaler Load Register High */
#define CH32V_RTC_PSCRH_PRLH_MASK         (0xf << 0)
#define CH32V_RTC_PSCRL_OFFSET            0x000c
#define CH32V_RTC_PSCRL                   (CH32V_RTC_BASE + CH32V_RTC_PSCRL_OFFSET) /* write-only */
#define CH32V_RTC_PSCRL_PRLL              (0xffff << 0) /* 0000ffff: RTC Prescaler Divider Register Low */
#define CH32V_RTC_PSCRL_PRLL_MASK         (0xffff << 0)
#define CH32V_RTC_DIVH_OFFSET             0x0010
#define CH32V_RTC_DIVH                    (CH32V_RTC_BASE + CH32V_RTC_DIVH_OFFSET) /* read-only */
#define CH32V_RTC_DIVH_DIVH               (0xf << 0) /* 0000000f: RTC prescaler divider register high */
#define CH32V_RTC_DIVH_DIVH_MASK          (0xf << 0)
#define CH32V_RTC_DIVL_OFFSET             0x0014
#define CH32V_RTC_DIVL                    (CH32V_RTC_BASE + CH32V_RTC_DIVL_OFFSET) /* read-only */
#define CH32V_RTC_DIVL_DIVL               (0xffff << 0) /* 0000ffff: RTC prescaler divider register Low */
#define CH32V_RTC_DIVL_DIVL_MASK          (0xffff << 0)
#define CH32V_RTC_CNTH_OFFSET             0x0018
#define CH32V_RTC_CNTH                    (CH32V_RTC_BASE + CH32V_RTC_CNTH_OFFSET) /* read-write */
#define CH32V_RTC_CNTH_CNTH               (0xffff << 0) /* 0000ffff: RTC counter register high */
#define CH32V_RTC_CNTH_CNTH_MASK          (0xffff << 0)
#define CH32V_RTC_CNTL_OFFSET             0x001c
#define CH32V_RTC_CNTL                    (CH32V_RTC_BASE + CH32V_RTC_CNTL_OFFSET) /* read-write */
#define CH32V_RTC_CNTL_CNTL               (0xffff << 0) /* 0000ffff: RTC counter register Low */
#define CH32V_RTC_CNTL_CNTL_MASK          (0xffff << 0)
#define CH32V_RTC_ALRMH_OFFSET            0x0020
#define CH32V_RTC_ALRMH                   (CH32V_RTC_BASE + CH32V_RTC_ALRMH_OFFSET) /* write-only */
#define CH32V_RTC_ALRMH_ALRH              (0xffff << 0) /* 0000ffff: RTC alarm register high */
#define CH32V_RTC_ALRMH_ALRH_MASK         (0xffff << 0)
#define CH32V_RTC_ALRML_OFFSET            0x0024
#define CH32V_RTC_ALRML                   (CH32V_RTC_BASE + CH32V_RTC_ALRML_OFFSET) /* write-only */
#define CH32V_RTC_ALRML_ALRL              (0xffff << 0) /* 0000ffff: RTC alarm register low */
#define CH32V_RTC_ALRML_ALRL_MASK         (0xffff << 0)

