robertlipe/svdtoheaders/demo/h/ch32v307_reg.h
/* SPI1 - Serial peripheral interface */
#define CH32V_SPI1_BASE                   0x40013000
#define CH32V_SPI1_CTLR1_OFFSET           0x0000
#define CH32V_SPI1_CTLR1                  (CH32V_SPI1_BASE + CH32V_SPI1_CTLR1_OFFSET) /* read-write */
#define CH32V_SPI1_CTLR1_BIDIMODE         (1 << 15) /* 00008000: Bidirectional data mode enable */
#define CH32V_SPI1_CTLR1_BIDIOE           (1 << 14) /* 00004000: Output enable in bidirectional mode */
#define CH32V_SPI1_CTLR1_CRCEN            (1 << 13) /* 00002000: Hardware CRC calculation enable */
#define CH32V_SPI1_CTLR1_CRCNEXT          (1 << 12) /* 00001000: CRC transfer next */
#define CH32V_SPI1_CTLR1_DFF              (1 << 11) /* 00000800: Data frame format */
#define CH32V_SPI1_CTLR1_RXONLY           (1 << 10) /* 00000400: Receive only */
#define CH32V_SPI1_CTLR1_SSM              (1 <<  9) /* 00000200: Software slave management */
#define CH32V_SPI1_CTLR1_SSI              (1 <<  8) /* 00000100: Internal slave select */
#define CH32V_SPI1_CTLR1_LSBFIRST         (1 <<  7) /* 00000080: Frame format */
#define CH32V_SPI1_CTLR1_SPE              (1 <<  6) /* 00000040: SPI enable */
#define CH32V_SPI1_CTLR1_BR               (0x7 << 3) /* 00000038: Baud rate control */
#define CH32V_SPI1_CTLR1_BR_MASK          (0x7 << 3)
#define CH32V_SPI1_CTLR1_MSTR             (1 <<  2) /* 00000004: Master selection */
#define CH32V_SPI1_CTLR1_CPOL             (1 <<  1) /* 00000002: Clock polarity */
#define CH32V_SPI1_CTLR1_CPHA             (1 <<  0) /* 00000001: Clock phase */
#define CH32V_SPI1_CTLR2_OFFSET           0x0004
#define CH32V_SPI1_CTLR2                  (CH32V_SPI1_BASE + CH32V_SPI1_CTLR2_OFFSET) /* read-write */
#define CH32V_SPI1_CTLR2_TXEIE            (1 <<  7) /* 00000080: Tx buffer empty interrupt enable */
#define CH32V_SPI1_CTLR2_RXNEIE           (1 <<  6) /* 00000040: RX buffer not empty interrupt enable */
#define CH32V_SPI1_CTLR2_ERRIE            (1 <<  5) /* 00000020: Error interrupt enable */
#define CH32V_SPI1_CTLR2_SSOE             (1 <<  2) /* 00000004: SS output enable */
#define CH32V_SPI1_CTLR2_TXDMAEN          (1 <<  1) /* 00000002: Tx buffer DMA enable */
#define CH32V_SPI1_CTLR2_RXDMAEN          (1 <<  0) /* 00000001: Rx buffer DMA enable */
#define CH32V_SPI1_STATR_OFFSET           0x0008
#define CH32V_SPI1_STATR                  (CH32V_SPI1_BASE + CH32V_SPI1_STATR_OFFSET)
#define CH32V_SPI1_STATR_BSY              (1 <<  7) /* 00000080: Busy flag */
#define CH32V_SPI1_STATR_OVR              (1 <<  6) /* 00000040: Overrun flag */
#define CH32V_SPI1_STATR_MODF             (1 <<  5) /* 00000020: Mode fault */
#define CH32V_SPI1_STATR_CRCERR           (1 <<  4) /* 00000010: CRC error flag */
#define CH32V_SPI1_STATR_UDR              (1 <<  3) /* 00000008: Underrun flag */
#define CH32V_SPI1_STATR_CHSID            (1 <<  2) /* 00000004: Channel side */
#define CH32V_SPI1_STATR_TXE              (1 <<  1) /* 00000002: Transmit buffer empty */
#define CH32V_SPI1_STATR_RXNE             (1 <<  0) /* 00000001: Receive buffer not empty */
#define CH32V_SPI1_DATAR_OFFSET           0x000c
#define CH32V_SPI1_DATAR                  (CH32V_SPI1_BASE + CH32V_SPI1_DATAR_OFFSET) /* read-write */
#define CH32V_SPI1_DATAR_DATAR            (0xffff << 0) /* 0000ffff: Data register */
#define CH32V_SPI1_DATAR_DATAR_MASK       (0xffff << 0)
#define CH32V_SPI1_CRCR_OFFSET            0x0010
#define CH32V_SPI1_CRCR                   (CH32V_SPI1_BASE + CH32V_SPI1_CRCR_OFFSET) /* read-write */
#define CH32V_SPI1_CRCR_CRCPOLY           (0xffff << 0) /* 0000ffff: CRC polynomial register */
#define CH32V_SPI1_CRCR_CRCPOLY_MASK      (0xffff << 0)
#define CH32V_SPI1_RCRCR_OFFSET           0x0014
#define CH32V_SPI1_RCRCR                  (CH32V_SPI1_BASE + CH32V_SPI1_RCRCR_OFFSET) /* read-only */
#define CH32V_SPI1_RCRCR_RXCRC            (0xffff << 0) /* 0000ffff: Rx CRC register */
#define CH32V_SPI1_RCRCR_RXCRC_MASK       (0xffff << 0)
#define CH32V_SPI1_TCRCR_OFFSET           0x0018
#define CH32V_SPI1_TCRCR                  (CH32V_SPI1_BASE + CH32V_SPI1_TCRCR_OFFSET) /* read-only */
#define CH32V_SPI1_TCRCR_TXCRC            (0xffff << 0) /* 0000ffff: Tx CRC register */
#define CH32V_SPI1_TCRCR_TXCRC_MASK       (0xffff << 0)
#define CH32V_SPI1_SPI_I2S_CFGR_OFFSET    0x001c
#define CH32V_SPI1_SPI_I2S_CFGR           (CH32V_SPI1_BASE + CH32V_SPI1_SPI_I2S_CFGR_OFFSET) /* read-write */
#define CH32V_SPI1_SPI_I2S_CFGR_CHLEN     (1 <<  0) /* 00000001: Channel length (number of bits per audio channel) */
#define CH32V_SPI1_SPI_I2S_CFGR_DATLEN    (0x3 << 1) /* 00000006: DATLEN[1:0] bits (Data length to be transferred) */
#define CH32V_SPI1_SPI_I2S_CFGR_DATLEN_MASK (0x3 << 1)
#define CH32V_SPI1_SPI_I2S_CFGR_CKPOL     (1 <<  3) /* 00000008: steady state clock polarity */
#define CH32V_SPI1_SPI_I2S_CFGR_I2SSTD    (0x3 << 4) /* 00000030: I2SSTD[1:0] bits (I2S standard selection) */
#define CH32V_SPI1_SPI_I2S_CFGR_I2SSTD_MASK (0x3 << 4)
#define CH32V_SPI1_SPI_I2S_CFGR_PCMSYNC   (1 <<  7) /* 00000080: PCM frame synchronization */
#define CH32V_SPI1_SPI_I2S_CFGR_I2SCFG    (0x3 << 8) /* 00000300: I2SCFG[1:0] bits (I2S configuration mode) */
#define CH32V_SPI1_SPI_I2S_CFGR_I2SCFG_MASK (0x3 << 8)
#define CH32V_SPI1_SPI_I2S_CFGR_I2SE      (1 << 10) /* 00000400: I2S Enable */
#define CH32V_SPI1_SPI_I2S_CFGR_I2SMOD    (1 << 11) /* 00000800: I2S mode selection */
#define CH32V_SPI1_HSCR_OFFSET            0x0024
#define CH32V_SPI1_HSCR                   (CH32V_SPI1_BASE + CH32V_SPI1_HSCR_OFFSET) /* read-write */
#define CH32V_SPI1_HSCR_HSRXEN            (1 <<  0) /* 00000001: High speed mode read enable */

/* SPI2 - Serial peripheral interface */
#define CH32V_SPI2_BASE                   0x40003800
#define CH32V_SPI2_CTLR1_OFFSET           0x0000
#define CH32V_SPI2_CTLR1                  (CH32V_SPI2_BASE + CH32V_SPI2_CTLR1_OFFSET) /* read-write */
#define CH32V_SPI2_CTLR1_BIDIMODE         (1 << 15) /* 00008000: Bidirectional data mode enable */
#define CH32V_SPI2_CTLR1_BIDIOE           (1 << 14) /* 00004000: Output enable in bidirectional mode */
#define CH32V_SPI2_CTLR1_CRCEN            (1 << 13) /* 00002000: Hardware CRC calculation enable */
#define CH32V_SPI2_CTLR1_CRCNEXT          (1 << 12) /* 00001000: CRC transfer next */
#define CH32V_SPI2_CTLR1_DFF              (1 << 11) /* 00000800: Data frame format */
#define CH32V_SPI2_CTLR1_RXONLY           (1 << 10) /* 00000400: Receive only */
#define CH32V_SPI2_CTLR1_SSM              (1 <<  9) /* 00000200: Software slave management */
#define CH32V_SPI2_CTLR1_SSI              (1 <<  8) /* 00000100: Internal slave select */
#define CH32V_SPI2_CTLR1_LSBFIRST         (1 <<  7) /* 00000080: Frame format */
#define CH32V_SPI2_CTLR1_SPE              (1 <<  6) /* 00000040: SPI enable */
#define CH32V_SPI2_CTLR1_BR               (0x7 << 3) /* 00000038: Baud rate control */
#define CH32V_SPI2_CTLR1_BR_MASK          (0x7 << 3)
#define CH32V_SPI2_CTLR1_MSTR             (1 <<  2) /* 00000004: Master selection */
#define CH32V_SPI2_CTLR1_CPOL             (1 <<  1) /* 00000002: Clock polarity */
#define CH32V_SPI2_CTLR1_CPHA             (1 <<  0) /* 00000001: Clock phase */
#define CH32V_SPI2_CTLR2_OFFSET           0x0004
#define CH32V_SPI2_CTLR2                  (CH32V_SPI2_BASE + CH32V_SPI2_CTLR2_OFFSET) /* read-write */
#define CH32V_SPI2_CTLR2_TXEIE            (1 <<  7) /* 00000080: Tx buffer empty interrupt enable */
#define CH32V_SPI2_CTLR2_RXNEIE           (1 <<  6) /* 00000040: RX buffer not empty interrupt enable */
#define CH32V_SPI2_CTLR2_ERRIE            (1 <<  5) /* 00000020: Error interrupt enable */
#define CH32V_SPI2_CTLR2_SSOE             (1 <<  2) /* 00000004: SS output enable */
#define CH32V_SPI2_CTLR2_TXDMAEN          (1 <<  1) /* 00000002: Tx buffer DMA enable */
#define CH32V_SPI2_CTLR2_RXDMAEN          (1 <<  0) /* 00000001: Rx buffer DMA enable */
#define CH32V_SPI2_STATR_OFFSET           0x0008
#define CH32V_SPI2_STATR                  (CH32V_SPI2_BASE + CH32V_SPI2_STATR_OFFSET)
#define CH32V_SPI2_STATR_BSY              (1 <<  7) /* 00000080: Busy flag */
#define CH32V_SPI2_STATR_OVR              (1 <<  6) /* 00000040: Overrun flag */
#define CH32V_SPI2_STATR_MODF             (1 <<  5) /* 00000020: Mode fault */
#define CH32V_SPI2_STATR_CRCERR           (1 <<  4) /* 00000010: CRC error flag */
#define CH32V_SPI2_STATR_TXE              (1 <<  1) /* 00000002: Transmit buffer empty */
#define CH32V_SPI2_STATR_RXNE             (1 <<  0) /* 00000001: Receive buffer not empty */
#define CH32V_SPI2_DATAR_OFFSET           0x000c
#define CH32V_SPI2_DATAR                  (CH32V_SPI2_BASE + CH32V_SPI2_DATAR_OFFSET) /* read-write */
#define CH32V_SPI2_DATAR_DATAR            (0xffff << 0) /* 0000ffff: Data register */
#define CH32V_SPI2_DATAR_DATAR_MASK       (0xffff << 0)
#define CH32V_SPI2_CRCR_OFFSET            0x0010
#define CH32V_SPI2_CRCR                   (CH32V_SPI2_BASE + CH32V_SPI2_CRCR_OFFSET) /* read-write */
#define CH32V_SPI2_CRCR_CRCPOLY           (0xffff << 0) /* 0000ffff: CRC polynomial register */
#define CH32V_SPI2_CRCR_CRCPOLY_MASK      (0xffff << 0)
#define CH32V_SPI2_RCRCR_OFFSET           0x0014
#define CH32V_SPI2_RCRCR                  (CH32V_SPI2_BASE + CH32V_SPI2_RCRCR_OFFSET) /* read-only */
#define CH32V_SPI2_RCRCR_RXCRC            (0xffff << 0) /* 0000ffff: Rx CRC register */
#define CH32V_SPI2_RCRCR_RXCRC_MASK       (0xffff << 0)
#define CH32V_SPI2_TCRCR_OFFSET           0x0018
#define CH32V_SPI2_TCRCR                  (CH32V_SPI2_BASE + CH32V_SPI2_TCRCR_OFFSET) /* read-only */
#define CH32V_SPI2_TCRCR_TXCRC            (0xffff << 0) /* 0000ffff: Tx CRC register */
#define CH32V_SPI2_TCRCR_TXCRC_MASK       (0xffff << 0)
#define CH32V_SPI2_I2SCFGR_OFFSET         0x001c
#define CH32V_SPI2_I2SCFGR                (CH32V_SPI2_BASE + CH32V_SPI2_I2SCFGR_OFFSET) /* read-write */
#define CH32V_SPI2_I2SCFGR_I2SMOD         (1 << 11) /* 00000800: I2S mode selection */
#define CH32V_SPI2_I2SCFGR_I2SE           (1 << 10) /* 00000400: I2S Enable */
#define CH32V_SPI2_I2SCFGR_I2SCFG         (0x3 << 8) /* 00000300: I2S configuration mode */
#define CH32V_SPI2_I2SCFGR_I2SCFG_MASK    (0x3 << 8)
#define CH32V_SPI2_I2SCFGR_PCMSYNC        (1 <<  7) /* 00000080: PCM frame synchronization */
#define CH32V_SPI2_I2SCFGR_I2SSTD         (0x3 << 4) /* 00000030: I2S standard selection */
#define CH32V_SPI2_I2SCFGR_I2SSTD_MASK    (0x3 << 4)
#define CH32V_SPI2_I2SCFGR_CKPOL          (1 <<  3) /* 00000008: Steady state clock polarity */
#define CH32V_SPI2_I2SCFGR_DATLEN         (0x3 << 1) /* 00000006: Data length to be transferred */
#define CH32V_SPI2_I2SCFGR_DATLEN_MASK    (0x3 << 1)
#define CH32V_SPI2_I2SCFGR_CHLEN          (1 <<  0) /* 00000001: Channel length (number of bits per audio channel) */
#define CH32V_SPI2_I2SPR_OFFSET           0x0020
#define CH32V_SPI2_I2SPR                  (CH32V_SPI2_BASE + CH32V_SPI2_I2SPR_OFFSET) /* read-write */
#define CH32V_SPI2_I2SPR_MCKOE            (1 <<  9) /* 00000200: Master clock output enable */
#define CH32V_SPI2_I2SPR_ODD              (1 <<  8) /* 00000100: Odd factor for the prescaler */
#define CH32V_SPI2_I2SPR_I2SDIV           (0xff << 0) /* 000000ff: I2S Linear prescaler */
#define CH32V_SPI2_I2SPR_I2SDIV_MASK      (0xff << 0)
#define CH32V_SPI2_HSCR_OFFSET            0x0024
#define CH32V_SPI2_HSCR                   (CH32V_SPI2_BASE + CH32V_SPI2_HSCR_OFFSET) /* read-write */
#define CH32V_SPI2_HSCR_HSRXEN            (1 <<  0) /* 00000001: High speed mode read enable */

/* USART1 - Universal synchronous asynchronous receiver transmitter */
#define CH32V_USART1_BASE                 0x40013800
#define CH32V_USART1_STATR_OFFSET         0x0000
#define CH32V_USART1_STATR                (CH32V_USART1_BASE + CH32V_USART1_STATR_OFFSET)
#define CH32V_USART1_STATR_CTS            (1 <<  9) /* 00000200: CTS flag */
#define CH32V_USART1_STATR_LBD            (1 <<  8) /* 00000100: LIN break detection flag */
#define CH32V_USART1_STATR_TXE            (1 <<  7) /* 00000080: Transmit data register empty */
#define CH32V_USART1_STATR_TC             (1 <<  6) /* 00000040: Transmission complete */
#define CH32V_USART1_STATR_RXNE           (1 <<  5) /* 00000020: Read data register not empty */
#define CH32V_USART1_STATR_IDLE           (1 <<  4) /* 00000010: IDLE line detected */
#define CH32V_USART1_STATR_ORE            (1 <<  3) /* 00000008: Overrun error */
#define CH32V_USART1_STATR_NE             (1 <<  2) /* 00000004: Noise error flag */
#define CH32V_USART1_STATR_FE             (1 <<  1) /* 00000002: Framing error */
#define CH32V_USART1_STATR_PE             (1 <<  0) /* 00000001: Parity error */
#define CH32V_USART1_DATAR_OFFSET         0x0004
#define CH32V_USART1_DATAR                (CH32V_USART1_BASE + CH32V_USART1_DATAR_OFFSET) /* read-write */
#define CH32V_USART1_DATAR_DR             (0x1ff << 0) /* 000001ff: Data value */
#define CH32V_USART1_DATAR_DR_MASK        (0x1ff << 0)
#define CH32V_USART1_BRR_OFFSET           0x0008
#define CH32V_USART1_BRR                  (CH32V_USART1_BASE + CH32V_USART1_BRR_OFFSET) /* read-write */
#define CH32V_USART1_BRR_DIV_Mantissa     (0xfff << 4) /* 0000fff0: mantissa of USARTDIV */
#define CH32V_USART1_BRR_DIV_Mantissa_MASK (0xfff << 4)
#define CH32V_USART1_BRR_DIV_Fraction     (0xf << 0) /* 0000000f: fraction of USARTDIV */
#define CH32V_USART1_BRR_DIV_Fraction_MASK (0xf << 0)
#define CH32V_USART1_CTLR1_OFFSET         0x000c
#define CH32V_USART1_CTLR1                (CH32V_USART1_BASE + CH32V_USART1_CTLR1_OFFSET) /* read-write */
#define CH32V_USART1_CTLR1_UE             (1 << 13) /* 00002000: USART enable */
#define CH32V_USART1_CTLR1_M              (1 << 12) /* 00001000: Word length */
#define CH32V_USART1_CTLR1_WAKE           (1 << 11) /* 00000800: Wakeup method */
#define CH32V_USART1_CTLR1_PCE            (1 << 10) /* 00000400: Parity control enable */
#define CH32V_USART1_CTLR1_PS             (1 <<  9) /* 00000200: Parity selection */
#define CH32V_USART1_CTLR1_PEIE           (1 <<  8) /* 00000100: PE interrupt enable */
#define CH32V_USART1_CTLR1_TXEIE          (1 <<  7) /* 00000080: TXE interrupt enable */
#define CH32V_USART1_CTLR1_TCIE           (1 <<  6) /* 00000040: Transmission complete interrupt enable */
#define CH32V_USART1_CTLR1_RXNEIE         (1 <<  5) /* 00000020: RXNE interrupt enable */
#define CH32V_USART1_CTLR1_IDLEIE         (1 <<  4) /* 00000010: IDLE interrupt enable */
#define CH32V_USART1_CTLR1_TE             (1 <<  3) /* 00000008: Transmitter enable */
#define CH32V_USART1_CTLR1_RE             (1 <<  2) /* 00000004: Receiver enable */
#define CH32V_USART1_CTLR1_RWU            (1 <<  1) /* 00000002: Receiver wakeup */
#define CH32V_USART1_CTLR1_SBK            (1 <<  0) /* 00000001: Send break */
#define CH32V_USART1_CTLR2_OFFSET         0x0010
#define CH32V_USART1_CTLR2                (CH32V_USART1_BASE + CH32V_USART1_CTLR2_OFFSET) /* read-write */
#define CH32V_USART1_CTLR2_LINEN          (1 << 14) /* 00004000: LIN mode enable */
#define CH32V_USART1_CTLR2_STOP           (0x3 << 12) /* 00003000: STOP bits */
#define CH32V_USART1_CTLR2_STOP_MASK      (0x3 << 12)
#define CH32V_USART1_CTLR2_CLKEN          (1 << 11) /* 00000800: Clock enable */
#define CH32V_USART1_CTLR2_CPOL           (1 << 10) /* 00000400: Clock polarity */
#define CH32V_USART1_CTLR2_CPHA           (1 <<  9) /* 00000200: Clock phase */
#define CH32V_USART1_CTLR2_LBCL           (1 <<  8) /* 00000100: Last bit clock pulse */
#define CH32V_USART1_CTLR2_LBDIE          (1 <<  6) /* 00000040: LIN break detection interrupt enable */
#define CH32V_USART1_CTLR2_LBDL           (1 <<  5) /* 00000020: lin break detection length */
#define CH32V_USART1_CTLR2_ADD            (0xf << 0) /* 0000000f: Address of the USART node */
#define CH32V_USART1_CTLR2_ADD_MASK       (0xf << 0)
#define CH32V_USART1_CTLR3_OFFSET         0x0014
#define CH32V_USART1_CTLR3                (CH32V_USART1_BASE + CH32V_USART1_CTLR3_OFFSET) /* read-write */
#define CH32V_USART1_CTLR3_CTSIE          (1 << 10) /* 00000400: CTS interrupt enable */
#define CH32V_USART1_CTLR3_CTSE           (1 <<  9) /* 00000200: CTS enable */
#define CH32V_USART1_CTLR3_RTSE           (1 <<  8) /* 00000100: RTS enable */
#define CH32V_USART1_CTLR3_DMAT           (1 <<  7) /* 00000080: DMA enable transmitter */
#define CH32V_USART1_CTLR3_DMAR           (1 <<  6) /* 00000040: DMA enable receiver */
#define CH32V_USART1_CTLR3_SCEN           (1 <<  5) /* 00000020: Smartcard mode enable */
#define CH32V_USART1_CTLR3_NACK           (1 <<  4) /* 00000010: Smartcard NACK enable */
#define CH32V_USART1_CTLR3_HDSEL          (1 <<  3) /* 00000008: Half-duplex selection */
#define CH32V_USART1_CTLR3_IRLP           (1 <<  2) /* 00000004: IrDA low-power */
#define CH32V_USART1_CTLR3_IREN           (1 <<  1) /* 00000002: IrDA mode enable */
#define CH32V_USART1_CTLR3_EIE            (1 <<  0) /* 00000001: Error interrupt enable */
#define CH32V_USART1_GPR_OFFSET           0x0018
#define CH32V_USART1_GPR                  (CH32V_USART1_BASE + CH32V_USART1_GPR_OFFSET) /* read-write */
#define CH32V_USART1_GPR_GT               (0xff << 8) /* 0000ff00: Guard time value */
#define CH32V_USART1_GPR_GT_MASK          (0xff << 8)
#define CH32V_USART1_GPR_PSC              (0xff << 0) /* 000000ff: Prescaler value */
#define CH32V_USART1_GPR_PSC_MASK         (0xff << 0)

