robertlipe/svdtoheaders/demo/h/ch32v307_reg.h
/* CRC - CRC calculation unit */
#define CH32V_CRC_BASE                    0x40023000
#define CH32V_CRC_DATAR_OFFSET            0x0000
#define CH32V_CRC_DATAR                   (CH32V_CRC_BASE + CH32V_CRC_DATAR_OFFSET) /* read-write */
#define CH32V_CRC_DATAR_DR                (0xffffffff << 0) /* ffffffff: Data Register */
#define CH32V_CRC_DATAR_DR_MASK           (0xffffffff << 0)
#define CH32V_CRC_IDATAR_OFFSET           0x0004
#define CH32V_CRC_IDATAR                  (CH32V_CRC_BASE + CH32V_CRC_IDATAR_OFFSET) /* read-write */
#define CH32V_CRC_IDATAR_IDR              (0xff << 0) /* 000000ff: Independent Data register */
#define CH32V_CRC_IDATAR_IDR_MASK         (0xff << 0)
#define CH32V_CRC_CTLR_OFFSET             0x0008
#define CH32V_CRC_CTLR                    (CH32V_CRC_BASE + CH32V_CRC_CTLR_OFFSET) /* write-only */
#define CH32V_CRC_CTLR_RESET              (1 <<  0) /* 00000001: Reset bit */

/* FLASH - FLASH */
#define CH32V_FLASH_BASE                  0x40022000
#define CH32V_FLASH_KEYR_OFFSET           0x0004
#define CH32V_FLASH_KEYR                  (CH32V_FLASH_BASE + CH32V_FLASH_KEYR_OFFSET) /* write-only */
#define CH32V_FLASH_KEYR_KEYR             (0xffffffff << 0) /* ffffffff: FPEC key */
#define CH32V_FLASH_KEYR_KEYR_MASK        (0xffffffff << 0)
#define CH32V_FLASH_OBKEYR_OFFSET         0x0008
#define CH32V_FLASH_OBKEYR                (CH32V_FLASH_BASE + CH32V_FLASH_OBKEYR_OFFSET) /* write-only */
#define CH32V_FLASH_OBKEYR_OPTKEY         (0xffffffff << 0) /* ffffffff: Option byte key */
#define CH32V_FLASH_OBKEYR_OPTKEY_MASK    (0xffffffff << 0)
#define CH32V_FLASH_STATR_OFFSET          0x000c
#define CH32V_FLASH_STATR                 (CH32V_FLASH_BASE + CH32V_FLASH_STATR_OFFSET)
#define CH32V_FLASH_STATR_ENHANCE_MOD_STA (1 <<  7) /* 00000080: Enhance mode start */
#define CH32V_FLASH_STATR_EOP             (1 <<  5) /* 00000020: End of operation */
#define CH32V_FLASH_STATR_WRPRTERR        (1 <<  4) /* 00000010: Write protection error */
#define CH32V_FLASH_STATR_WR_BSY          (1 <<  1) /* 00000002: Quick page programming */
#define CH32V_FLASH_STATR_BSY             (1 <<  0) /* 00000001: Busy */
#define CH32V_FLASH_CTLR_OFFSET           0x0010
#define CH32V_FLASH_CTLR                  (CH32V_FLASH_BASE + CH32V_FLASH_CTLR_OFFSET) /* read-write */
#define CH32V_FLASH_CTLR_PG               (1 <<  0) /* 00000001: Programming */
#define CH32V_FLASH_CTLR_PER              (1 <<  1) /* 00000002: Page Erase */
#define CH32V_FLASH_CTLR_MER              (1 <<  2) /* 00000004: Mass Erase */
#define CH32V_FLASH_CTLR_OBPG             (1 <<  4) /* 00000010: Option byte programming */
#define CH32V_FLASH_CTLR_OBER             (1 <<  5) /* 00000020: Option byte erase */
#define CH32V_FLASH_CTLR_STRT             (1 <<  6) /* 00000040: Start */
#define CH32V_FLASH_CTLR_LOCK             (1 <<  7) /* 00000080: Lock */
#define CH32V_FLASH_CTLR_OBWRE            (1 <<  9) /* 00000200: Option bytes write enable */
#define CH32V_FLASH_CTLR_ERRIE            (1 << 10) /* 00000400: Error interrupt enable */
#define CH32V_FLASH_CTLR_EOPIE            (1 << 12) /* 00001000: End of operation interrupt enable */
#define CH32V_FLASH_CTLR_FLOCK            (1 << 15) /* 00008000: Fast programmable lock */
#define CH32V_FLASH_CTLR_PAGE_PG          (1 << 16) /* 00010000: Fast programming */
#define CH32V_FLASH_CTLR_PAGE_ER          (1 << 17) /* 00020000: Fast erase */
#define CH32V_FLASH_CTLR_BER32            (1 << 18) /* 00040000: Block Erase 32K */
#define CH32V_FLASH_CTLR_BER64            (1 << 19) /* 00080000: Block Erase 64K */
#define CH32V_FLASH_CTLR_PGSTART          (1 << 21) /* 00200000: Page Programming Start */
#define CH32V_FLASH_CTLR_RSENACT          (1 << 22) /* 00400000: Reset Flash Enhance read mode */
#define CH32V_FLASH_CTLR_ENHANCEMODE      (1 << 24) /* 01000000: Flash Enhance read mode */
#define CH32V_FLASH_CTLR_SCKMODE          (1 << 25) /* 02000000: Flash SCK mode */
#define CH32V_FLASH_ADDR_OFFSET           0x0014
#define CH32V_FLASH_ADDR                  (CH32V_FLASH_BASE + CH32V_FLASH_ADDR_OFFSET) /* write-only */
#define CH32V_FLASH_ADDR_FAR              (0xffffffff << 0) /* ffffffff: Flash Address */
#define CH32V_FLASH_ADDR_FAR_MASK         (0xffffffff << 0)
#define CH32V_FLASH_OBR_OFFSET            0x001c
#define CH32V_FLASH_OBR                   (CH32V_FLASH_BASE + CH32V_FLASH_OBR_OFFSET) /* read-only */
#define CH32V_FLASH_OBR_OBERR             (1 <<  0) /* 00000001: Option byte error */
#define CH32V_FLASH_OBR_RDPRT             (1 <<  1) /* 00000002: Read protection */
#define CH32V_FLASH_OBR_IWDG_SW           (1 <<  2) /* 00000004: IWDG_SW */
#define CH32V_FLASH_OBR_STOP_RST          (1 <<  3) /* 00000008: STOP_RST */
#define CH32V_FLASH_OBR_STANDY_RST        (1 <<  4) /* 00000010: STANDY_RST */
#define CH32V_FLASH_OBR_SRAM_CODE_MODE    (0x3 << 8) /* 00000300: SRAM_CODE_MODE */
#define CH32V_FLASH_OBR_SRAM_CODE_MODE_MASK (0x3 << 8)
#define CH32V_FLASH_WPR_OFFSET            0x0020
#define CH32V_FLASH_WPR                   (CH32V_FLASH_BASE + CH32V_FLASH_WPR_OFFSET) /* read-only */
#define CH32V_FLASH_WPR_WRP               (0xffffffff << 0) /* ffffffff: Write protect */
#define CH32V_FLASH_WPR_WRP_MASK          (0xffffffff << 0)
#define CH32V_FLASH_MODEKEYR_OFFSET       0x0024
#define CH32V_FLASH_MODEKEYR              (CH32V_FLASH_BASE + CH32V_FLASH_MODEKEYR_OFFSET) /* write-only */
#define CH32V_FLASH_MODEKEYR_MODEKEYR     (0xffffffff << 0) /* ffffffff: Mode select */
#define CH32V_FLASH_MODEKEYR_MODEKEYR_MASK (0xffffffff << 0)

/* USB_OTG_FS - USB FS OTG register */
#define CH32V_USB_OTG_FS_BASE             0x50000000
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_OFFSET 0x0000
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_USBHD_BASE_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_OFFSET 0x0001
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_OFFSET 0x0002
#define CH32V_USB_OTG_FS_R8_USB_INT_EN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_INT_EN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_USB_DEV_AD_OFFSET 0x0003
#define CH32V_USB_OTG_FS_R8_USB_DEV_AD    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_DEV_AD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_OFFSET 0x0005
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_MIS_ST_OFFSET) /* read-only */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_OFFSET 0x0006
#define CH32V_USB_OTG_FS_R8_USB_INT_FG    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_INT_FG_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_USB_INT_ST_OFFSET 0x0007
#define CH32V_USB_OTG_FS_R8_USB_INT_ST    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_INT_ST_OFFSET) /* read-only */
#define CH32V_USB_OTG_FS_R16_USB_RX_LEN_OFFSET 0x0008
#define CH32V_USB_OTG_FS_R16_USB_RX_LEN   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R16_USB_RX_LEN_OFFSET) /* read-only */
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD_OFFSET 0x000c
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP4_1_MOD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_OFFSET 0x000d
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD_OFFSET 0x000e
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP5_6_MOD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP7_MOD_OFFSET 0x000f
#define CH32V_USB_OTG_FS_R8_UEP7_MOD      (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP7_MOD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP0_DMA_OFFSET 0x0010
#define CH32V_USB_OTG_FS_R32_UEP0_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP0_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP1_DMA_OFFSET 0x0014
#define CH32V_USB_OTG_FS_R32_UEP1_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP1_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP2_DMA__R32_UH_RX_DMA_OFFSET 0x0018
#define CH32V_USB_OTG_FS_R32_UEP2_DMA__R32_UH_RX_DMA (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP2_DMA__R32_UH_RX_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP3_DMA__R32_UH_TX_DMA_OFFSET 0x001c
#define CH32V_USB_OTG_FS_R32_UEP3_DMA__R32_UH_TX_DMA (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP3_DMA__R32_UH_TX_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP4_DMA_OFFSET 0x0020
#define CH32V_USB_OTG_FS_R32_UEP4_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP4_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP5_DMA_OFFSET 0x0024
#define CH32V_USB_OTG_FS_R32_UEP5_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP5_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP6_DMA_OFFSET 0x0028
#define CH32V_USB_OTG_FS_R32_UEP6_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP6_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP7_DMA_OFFSET 0x002c
#define CH32V_USB_OTG_FS_R32_UEP7_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP7_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP0_T_LEN_OFFSET 0x0030
#define CH32V_USB_OTG_FS_R8_UEP0_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP0_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP0_T_CTRL_OFFSET 0x0032
#define CH32V_USB_OTG_FS_R8_UEP0_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP0_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP0_R_CTRL_OFFSET 0x0033
#define CH32V_USB_OTG_FS_R8_UEP0_R_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP0_R_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP1_T_LEN_OFFSET 0x0034
#define CH32V_USB_OTG_FS_R8_UEP1_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP1_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_OFFSET 0x0036
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP1_R_CTRL_OFFSET 0x0037
#define CH32V_USB_OTG_FS_R8_UEP1_R_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP1_R_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID_OFFSET 0x0038
#define CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP2_T_CTRL_OFFSET 0x003a
#define CH32V_USB_OTG_FS_R8_UEP2_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP2_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL_OFFSET 0x003b
#define CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP3_T_LEN__USBHD_UH_TX_LEN_OFFSET 0x003c
#define CH32V_USB_OTG_FS_R8_UEP3_T_LEN__USBHD_UH_TX_LEN (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP3_T_LEN__USBHD_UH_TX_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL_OFFSET 0x003e
#define CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP3_R_CTRL__OFFSET 0x003f
#define CH32V_USB_OTG_FS_R8_UEP3_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP3_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP4_T_LEN_OFFSET 0x0040
#define CH32V_USB_OTG_FS_R8_UEP4_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP4_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP4_T_CTRL_OFFSET 0x0042
#define CH32V_USB_OTG_FS_R8_UEP4_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP4_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP4_R_CTRL__OFFSET 0x0043
#define CH32V_USB_OTG_FS_R8_UEP4_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP4_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP5_T_LEN_OFFSET 0x0044
#define CH32V_USB_OTG_FS_R8_UEP5_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP5_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP5_T_CTRL_OFFSET 0x0046
#define CH32V_USB_OTG_FS_R8_UEP5_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP5_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP5_R_CTRL__OFFSET 0x0047
#define CH32V_USB_OTG_FS_R8_UEP5_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP5_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP6_T_LEN_OFFSET 0x0048
#define CH32V_USB_OTG_FS_R8_UEP6_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP6_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP6_T_CTRL_OFFSET 0x004a
#define CH32V_USB_OTG_FS_R8_UEP6_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP6_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP6_R_CTRL__OFFSET 0x004b
#define CH32V_USB_OTG_FS_R8_UEP6_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP6_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP7_T_LEN_OFFSET 0x004c
#define CH32V_USB_OTG_FS_R8_UEP7_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP7_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP7_T_CTRL_OFFSET 0x004e
#define CH32V_USB_OTG_FS_R8_UEP7_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP7_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP7_R_CTRL__OFFSET 0x004f
#define CH32V_USB_OTG_FS_R8_UEP7_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP7_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_USB_OTG_CR_OFFSET 0x0054
#define CH32V_USB_OTG_FS_USB_OTG_CR       (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_USB_OTG_CR_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_USB_OTG_SR_OFFSET 0x0058
#define CH32V_USB_OTG_FS_USB_OTG_SR       (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_USB_OTG_SR_OFFSET) /* read-write */

