robertlipe/svdtoheaders/demo/h/ch32v307_reg.h
/* PFIC - Programmable Fast Interrupt Controller */
#define CH32V_PFIC_BASE                   0xe000e000
#define CH32V_PFIC_ISR1_OFFSET            0x0000
#define CH32V_PFIC_ISR1                   (CH32V_PFIC_BASE + CH32V_PFIC_ISR1_OFFSET) /* read-only */
#define CH32V_PFIC_ISR1_INTENSTA2_3       (0x3 << 2) /* 0000000c: Interrupt ID Status */
#define CH32V_PFIC_ISR1_INTENSTA2_3_MASK  (0x3 << 2)
#define CH32V_PFIC_ISR1_INTENSTA12_31     (0xfffff << 12) /* fffff000: Interrupt ID Status */
#define CH32V_PFIC_ISR1_INTENSTA12_31_MASK (0xfffff << 12)
#define CH32V_PFIC_ISR2_OFFSET            0x0004
#define CH32V_PFIC_ISR2                   (CH32V_PFIC_BASE + CH32V_PFIC_ISR2_OFFSET) /* read-only */
#define CH32V_PFIC_ISR2_INTENSTA          (0xffffffff << 0) /* ffffffff: Interrupt ID Status */
#define CH32V_PFIC_ISR2_INTENSTA_MASK     (0xffffffff << 0)
#define CH32V_PFIC_ISR3_OFFSET            0x0008
#define CH32V_PFIC_ISR3                   (CH32V_PFIC_BASE + CH32V_PFIC_ISR3_OFFSET) /* read-only */
#define CH32V_PFIC_ISR3_INTENSTA          (0xffffffff << 0) /* ffffffff: Interrupt ID Status */
#define CH32V_PFIC_ISR3_INTENSTA_MASK     (0xffffffff << 0)
#define CH32V_PFIC_ISR4_OFFSET            0x000c
#define CH32V_PFIC_ISR4                   (CH32V_PFIC_BASE + CH32V_PFIC_ISR4_OFFSET) /* read-only */
#define CH32V_PFIC_ISR4_INTENSTA          (0xff << 0) /* 000000ff: Interrupt ID Status */
#define CH32V_PFIC_ISR4_INTENSTA_MASK     (0xff << 0)
#define CH32V_PFIC_IPR1_OFFSET            0x0020
#define CH32V_PFIC_IPR1                   (CH32V_PFIC_BASE + CH32V_PFIC_IPR1_OFFSET) /* read-only */
#define CH32V_PFIC_IPR1_PENDSTA2_3        (0x3 << 2) /* 0000000c: PENDSTA */
#define CH32V_PFIC_IPR1_PENDSTA2_3_MASK   (0x3 << 2)
#define CH32V_PFIC_IPR1_PENDSTA12_31      (0xfffff << 12) /* fffff000: PENDSTA */
#define CH32V_PFIC_IPR1_PENDSTA12_31_MASK (0xfffff << 12)
#define CH32V_PFIC_IPR2_OFFSET            0x0024
#define CH32V_PFIC_IPR2                   (CH32V_PFIC_BASE + CH32V_PFIC_IPR2_OFFSET) /* read-only */
#define CH32V_PFIC_IPR2_PENDSTA           (0xffffffff << 0) /* ffffffff: PENDSTA */
#define CH32V_PFIC_IPR2_PENDSTA_MASK      (0xffffffff << 0)
#define CH32V_PFIC_IPR3_OFFSET            0x0028
#define CH32V_PFIC_IPR3                   (CH32V_PFIC_BASE + CH32V_PFIC_IPR3_OFFSET) /* read-only */
#define CH32V_PFIC_IPR3_PENDSTA           (0xffffffff << 0) /* ffffffff: PENDSTA */
#define CH32V_PFIC_IPR3_PENDSTA_MASK      (0xffffffff << 0)
#define CH32V_PFIC_IPR4_OFFSET            0x002c
#define CH32V_PFIC_IPR4                   (CH32V_PFIC_BASE + CH32V_PFIC_IPR4_OFFSET) /* read-only */
#define CH32V_PFIC_IPR4_PENDSTA           (0xff << 0) /* 000000ff: PENDSTA */
#define CH32V_PFIC_IPR4_PENDSTA_MASK      (0xff << 0)
#define CH32V_PFIC_ITHRESDR_OFFSET        0x0040
#define CH32V_PFIC_ITHRESDR               (CH32V_PFIC_BASE + CH32V_PFIC_ITHRESDR_OFFSET) /* read-write */
#define CH32V_PFIC_ITHRESDR_THRESHOLD     (0xff << 0) /* 000000ff: THRESHOLD */
#define CH32V_PFIC_ITHRESDR_THRESHOLD_MASK (0xff << 0)
#define CH32V_PFIC_CFGR_OFFSET            0x0048
#define CH32V_PFIC_CFGR                   (CH32V_PFIC_BASE + CH32V_PFIC_CFGR_OFFSET)
#define CH32V_PFIC_CFGR_RESETSYS          (1 <<  7) /* 00000080: RESETSYS */
#define CH32V_PFIC_CFGR_KEYCODE           (0xffff << 16) /* ffff0000: KEYCODE */
#define CH32V_PFIC_CFGR_KEYCODE_MASK      (0xffff << 16)
#define CH32V_PFIC_GISR_OFFSET            0x004c
#define CH32V_PFIC_GISR                   (CH32V_PFIC_BASE + CH32V_PFIC_GISR_OFFSET) /* read-only */
#define CH32V_PFIC_GISR_NESTSTA           (0xff << 0) /* 000000ff: NESTSTA */
#define CH32V_PFIC_GISR_NESTSTA_MASK      (0xff << 0)
#define CH32V_PFIC_GISR_GACTSTA           (1 <<  8) /* 00000100: GACTSTA */
#define CH32V_PFIC_GISR_GPENDSTA          (1 <<  9) /* 00000200: GPENDSTA */
#define CH32V_PFIC_VTFIDR_OFFSET          0x0050
#define CH32V_PFIC_VTFIDR                 (CH32V_PFIC_BASE + CH32V_PFIC_VTFIDR_OFFSET) /* read-write */
#define CH32V_PFIC_VTFIDR_VTFID0          (0xff << 0) /* 000000ff: VTFID0 */
#define CH32V_PFIC_VTFIDR_VTFID0_MASK     (0xff << 0)
#define CH32V_PFIC_VTFIDR_VTFID1          (0xff << 8) /* 0000ff00: VTFID1 */
#define CH32V_PFIC_VTFIDR_VTFID1_MASK     (0xff << 8)
#define CH32V_PFIC_VTFIDR_VTFID2          (0xff << 16) /* 00ff0000: VTFID2 */
#define CH32V_PFIC_VTFIDR_VTFID2_MASK     (0xff << 16)
#define CH32V_PFIC_VTFIDR_VTFID3          (0xff << 24) /* ff000000: VTFID3 */
#define CH32V_PFIC_VTFIDR_VTFID3_MASK     (0xff << 24)
#define CH32V_PFIC_VTFADDRR0_OFFSET       0x0060
#define CH32V_PFIC_VTFADDRR0              (CH32V_PFIC_BASE + CH32V_PFIC_VTFADDRR0_OFFSET) /* read-write */
#define CH32V_PFIC_VTFADDRR0_VTF0EN       (1 <<  0) /* 00000001: VTF0EN */
#define CH32V_PFIC_VTFADDRR0_ADDR0        (0x7fffffff << 1) /* fffffffe: ADDR0 */
#define CH32V_PFIC_VTFADDRR0_ADDR0_MASK   (0x7fffffff << 1)
#define CH32V_PFIC_VTFADDRR1_OFFSET       0x0064
#define CH32V_PFIC_VTFADDRR1              (CH32V_PFIC_BASE + CH32V_PFIC_VTFADDRR1_OFFSET) /* read-write */
#define CH32V_PFIC_VTFADDRR1_VTF1EN       (1 <<  0) /* 00000001: VTF1EN */
#define CH32V_PFIC_VTFADDRR1_ADDR1        (0x7fffffff << 1) /* fffffffe: ADDR1 */
#define CH32V_PFIC_VTFADDRR1_ADDR1_MASK   (0x7fffffff << 1)
#define CH32V_PFIC_VTFADDRR2_OFFSET       0x0068
#define CH32V_PFIC_VTFADDRR2              (CH32V_PFIC_BASE + CH32V_PFIC_VTFADDRR2_OFFSET) /* read-write */
#define CH32V_PFIC_VTFADDRR2_VTF2EN       (1 <<  0) /* 00000001: VTF2EN */
#define CH32V_PFIC_VTFADDRR2_ADDR2        (0x7fffffff << 1) /* fffffffe: ADDR2 */
#define CH32V_PFIC_VTFADDRR2_ADDR2_MASK   (0x7fffffff << 1)
#define CH32V_PFIC_VTFADDRR3_OFFSET       0x006c
#define CH32V_PFIC_VTFADDRR3              (CH32V_PFIC_BASE + CH32V_PFIC_VTFADDRR3_OFFSET) /* read-write */
#define CH32V_PFIC_VTFADDRR3_VTF3EN       (1 <<  0) /* 00000001: VTF3EN */
#define CH32V_PFIC_VTFADDRR3_ADDR3        (0x7fffffff << 1) /* fffffffe: ADDR3 */
#define CH32V_PFIC_VTFADDRR3_ADDR3_MASK   (0x7fffffff << 1)
#define CH32V_PFIC_IENR1_OFFSET           0x0100
#define CH32V_PFIC_IENR1                  (CH32V_PFIC_BASE + CH32V_PFIC_IENR1_OFFSET) /* write-only */
#define CH32V_PFIC_IENR1_INTEN            (0xfffff << 12) /* fffff000: INTEN */
#define CH32V_PFIC_IENR1_INTEN_MASK       (0xfffff << 12)
#define CH32V_PFIC_IENR2_OFFSET           0x0104
#define CH32V_PFIC_IENR2                  (CH32V_PFIC_BASE + CH32V_PFIC_IENR2_OFFSET) /* write-only */
#define CH32V_PFIC_IENR2_INTEN            (0xffffffff << 0) /* ffffffff: INTEN */
#define CH32V_PFIC_IENR2_INTEN_MASK       (0xffffffff << 0)
#define CH32V_PFIC_IENR3_OFFSET           0x0108
#define CH32V_PFIC_IENR3                  (CH32V_PFIC_BASE + CH32V_PFIC_IENR3_OFFSET) /* write-only */
#define CH32V_PFIC_IENR3_INTEN            (0xffffffff << 0) /* ffffffff: INTEN */
#define CH32V_PFIC_IENR3_INTEN_MASK       (0xffffffff << 0)
#define CH32V_PFIC_IENR4_OFFSET           0x010c
#define CH32V_PFIC_IENR4                  (CH32V_PFIC_BASE + CH32V_PFIC_IENR4_OFFSET) /* write-only */
#define CH32V_PFIC_IENR4_INTEN            (0xff << 0) /* 000000ff: INTEN */
#define CH32V_PFIC_IENR4_INTEN_MASK       (0xff << 0)
#define CH32V_PFIC_IRER1_OFFSET           0x0180
#define CH32V_PFIC_IRER1                  (CH32V_PFIC_BASE + CH32V_PFIC_IRER1_OFFSET) /* write-only */
#define CH32V_PFIC_IRER1_INTRSET          (0xfffff << 12) /* fffff000: INTRSET */
#define CH32V_PFIC_IRER1_INTRSET_MASK     (0xfffff << 12)
#define CH32V_PFIC_IRER2_OFFSET           0x0184
#define CH32V_PFIC_IRER2                  (CH32V_PFIC_BASE + CH32V_PFIC_IRER2_OFFSET) /* write-only */
#define CH32V_PFIC_IRER2_INTRSET          (0xffffffff << 0) /* ffffffff: INTRSET */
#define CH32V_PFIC_IRER2_INTRSET_MASK     (0xffffffff << 0)
#define CH32V_PFIC_IRER3_OFFSET           0x0188
#define CH32V_PFIC_IRER3                  (CH32V_PFIC_BASE + CH32V_PFIC_IRER3_OFFSET) /* write-only */
#define CH32V_PFIC_IRER3_INTRSET          (0xffffffff << 0) /* ffffffff: INTRSET */
#define CH32V_PFIC_IRER3_INTRSET_MASK     (0xffffffff << 0)
#define CH32V_PFIC_IRER4_OFFSET           0x018c
#define CH32V_PFIC_IRER4                  (CH32V_PFIC_BASE + CH32V_PFIC_IRER4_OFFSET) /* write-only */
#define CH32V_PFIC_IRER4_INTRSET          (0xff << 0) /* 000000ff: INTRSET */
#define CH32V_PFIC_IRER4_INTRSET_MASK     (0xff << 0)
#define CH32V_PFIC_IPSR1_OFFSET           0x0200
#define CH32V_PFIC_IPSR1                  (CH32V_PFIC_BASE + CH32V_PFIC_IPSR1_OFFSET) /* write-only */
#define CH32V_PFIC_IPSR1_PENDSET2_3       (0x3 << 2) /* 0000000c: PENDSET */
#define CH32V_PFIC_IPSR1_PENDSET2_3_MASK  (0x3 << 2)
#define CH32V_PFIC_IPSR1_PENDSET12_31     (0xfffff << 12) /* fffff000: PENDSET */
#define CH32V_PFIC_IPSR1_PENDSET12_31_MASK (0xfffff << 12)
#define CH32V_PFIC_IPSR2_OFFSET           0x0204
#define CH32V_PFIC_IPSR2                  (CH32V_PFIC_BASE + CH32V_PFIC_IPSR2_OFFSET) /* write-only */
#define CH32V_PFIC_IPSR2_PENDSET          (0xffffffff << 0) /* ffffffff: PENDSET */
#define CH32V_PFIC_IPSR2_PENDSET_MASK     (0xffffffff << 0)
#define CH32V_PFIC_IPSR3_OFFSET           0x0208
#define CH32V_PFIC_IPSR3                  (CH32V_PFIC_BASE + CH32V_PFIC_IPSR3_OFFSET) /* write-only */
#define CH32V_PFIC_IPSR3_PENDSET          (0xffffffff << 0) /* ffffffff: PENDSET */
#define CH32V_PFIC_IPSR3_PENDSET_MASK     (0xffffffff << 0)
#define CH32V_PFIC_IPSR4_OFFSET           0x020c
#define CH32V_PFIC_IPSR4                  (CH32V_PFIC_BASE + CH32V_PFIC_IPSR4_OFFSET) /* write-only */
#define CH32V_PFIC_IPSR4_PENDSET          (0xff << 0) /* 000000ff: PENDSET */
#define CH32V_PFIC_IPSR4_PENDSET_MASK     (0xff << 0)
#define CH32V_PFIC_IPRR1_OFFSET           0x0280
#define CH32V_PFIC_IPRR1                  (CH32V_PFIC_BASE + CH32V_PFIC_IPRR1_OFFSET) /* write-only */
#define CH32V_PFIC_IPRR1_PENDRESET2_3     (0x3 << 2) /* 0000000c: PENDRESET */
#define CH32V_PFIC_IPRR1_PENDRESET2_3_MASK (0x3 << 2)
#define CH32V_PFIC_IPRR1_PENDRESET12_31   (0xfffff << 12) /* fffff000: PENDRESET */
#define CH32V_PFIC_IPRR1_PENDRESET12_31_MASK (0xfffff << 12)
#define CH32V_PFIC_IPRR2_OFFSET           0x0284
#define CH32V_PFIC_IPRR2                  (CH32V_PFIC_BASE + CH32V_PFIC_IPRR2_OFFSET) /* write-only */
#define CH32V_PFIC_IPRR2_PENDRESET        (0xffffffff << 0) /* ffffffff: PENDRESET */
#define CH32V_PFIC_IPRR2_PENDRESET_MASK   (0xffffffff << 0)
#define CH32V_PFIC_IPRR3_OFFSET           0x0288
#define CH32V_PFIC_IPRR3                  (CH32V_PFIC_BASE + CH32V_PFIC_IPRR3_OFFSET) /* write-only */
#define CH32V_PFIC_IPRR3_PENDRESET        (0xffffffff << 0) /* ffffffff: PENDRESET */
#define CH32V_PFIC_IPRR3_PENDRESET_MASK   (0xffffffff << 0)
#define CH32V_PFIC_IPRR4_OFFSET           0x028c
#define CH32V_PFIC_IPRR4                  (CH32V_PFIC_BASE + CH32V_PFIC_IPRR4_OFFSET) /* write-only */
#define CH32V_PFIC_IPRR4_PENDRESET        (0xff << 0) /* 000000ff: PENDRESET */
#define CH32V_PFIC_IPRR4_PENDRESET_MASK   (0xff << 0)
#define CH32V_PFIC_IACTR1_OFFSET          0x0300
#define CH32V_PFIC_IACTR1                 (CH32V_PFIC_BASE + CH32V_PFIC_IACTR1_OFFSET) /* write-only */
#define CH32V_PFIC_IACTR1_IACTS2_3        (0x3 << 2) /* 0000000c: IACTS */
#define CH32V_PFIC_IACTR1_IACTS2_3_MASK   (0x3 << 2)
#define CH32V_PFIC_IACTR1_IACTS12_31      (0xfffff << 12) /* fffff000: IACTS */
#define CH32V_PFIC_IACTR1_IACTS12_31_MASK (0xfffff << 12)
#define CH32V_PFIC_IACTR2_OFFSET          0x0304
#define CH32V_PFIC_IACTR2                 (CH32V_PFIC_BASE + CH32V_PFIC_IACTR2_OFFSET) /* write-only */
#define CH32V_PFIC_IACTR2_IACTS           (0xffffffff << 0) /* ffffffff: IACTS */
#define CH32V_PFIC_IACTR2_IACTS_MASK      (0xffffffff << 0)
#define CH32V_PFIC_IACTR3_OFFSET          0x0308
#define CH32V_PFIC_IACTR3                 (CH32V_PFIC_BASE + CH32V_PFIC_IACTR3_OFFSET) /* write-only */
#define CH32V_PFIC_IACTR3_IACTS           (0xffffffff << 0) /* ffffffff: IACTS */
#define CH32V_PFIC_IACTR3_IACTS_MASK      (0xffffffff << 0)
#define CH32V_PFIC_IACTR4_OFFSET          0x030c
#define CH32V_PFIC_IACTR4                 (CH32V_PFIC_BASE + CH32V_PFIC_IACTR4_OFFSET) /* write-only */
#define CH32V_PFIC_IACTR4_IACTS           (0xff << 0) /* 000000ff: IACTS */
#define CH32V_PFIC_IACTR4_IACTS_MASK      (0xff << 0)
#define CH32V_PFIC_IPRIOR0_OFFSET         0x0400
#define CH32V_PFIC_IPRIOR0                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR0_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR1_OFFSET         0x0401
#define CH32V_PFIC_IPRIOR1                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR1_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR2_OFFSET         0x0402
#define CH32V_PFIC_IPRIOR2                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR2_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR3_OFFSET         0x0403
#define CH32V_PFIC_IPRIOR3                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR3_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR4_OFFSET         0x0404
#define CH32V_PFIC_IPRIOR4                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR4_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR5_OFFSET         0x0405
#define CH32V_PFIC_IPRIOR5                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR5_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR6_OFFSET         0x0406
#define CH32V_PFIC_IPRIOR6                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR6_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR7_OFFSET         0x0407
#define CH32V_PFIC_IPRIOR7                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR7_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR8_OFFSET         0x0408
#define CH32V_PFIC_IPRIOR8                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR8_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR9_OFFSET         0x0409
#define CH32V_PFIC_IPRIOR9                (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR9_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR10_OFFSET        0x040a
#define CH32V_PFIC_IPRIOR10               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR10_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR11_OFFSET        0x040b
#define CH32V_PFIC_IPRIOR11               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR11_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR12_OFFSET        0x040c
#define CH32V_PFIC_IPRIOR12               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR12_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR13_OFFSET        0x040d
#define CH32V_PFIC_IPRIOR13               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR13_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR14_OFFSET        0x040e
#define CH32V_PFIC_IPRIOR14               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR14_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR15_OFFSET        0x040f
#define CH32V_PFIC_IPRIOR15               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR15_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR16_OFFSET        0x0410
#define CH32V_PFIC_IPRIOR16               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR16_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR17_OFFSET        0x0411
#define CH32V_PFIC_IPRIOR17               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR17_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR18_OFFSET        0x0412
#define CH32V_PFIC_IPRIOR18               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR18_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR19_OFFSET        0x0413
#define CH32V_PFIC_IPRIOR19               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR19_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR20_OFFSET        0x0414
#define CH32V_PFIC_IPRIOR20               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR20_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR21_OFFSET        0x0415
#define CH32V_PFIC_IPRIOR21               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR21_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR22_OFFSET        0x0416
#define CH32V_PFIC_IPRIOR22               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR22_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR23_OFFSET        0x0417
#define CH32V_PFIC_IPRIOR23               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR23_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR24_OFFSET        0x0418
#define CH32V_PFIC_IPRIOR24               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR24_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR25_OFFSET        0x0419
#define CH32V_PFIC_IPRIOR25               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR25_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR26_OFFSET        0x041a
#define CH32V_PFIC_IPRIOR26               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR26_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR27_OFFSET        0x041b
#define CH32V_PFIC_IPRIOR27               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR27_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR28_OFFSET        0x041c
#define CH32V_PFIC_IPRIOR28               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR28_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR29_OFFSET        0x041d
#define CH32V_PFIC_IPRIOR29               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR29_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR30_OFFSET        0x041e
#define CH32V_PFIC_IPRIOR30               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR30_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR31_OFFSET        0x041f
#define CH32V_PFIC_IPRIOR31               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR31_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR32_OFFSET        0x0420
#define CH32V_PFIC_IPRIOR32               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR32_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR33_OFFSET        0x0421
#define CH32V_PFIC_IPRIOR33               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR33_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR34_OFFSET        0x0422
#define CH32V_PFIC_IPRIOR34               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR34_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR35_OFFSET        0x0423
#define CH32V_PFIC_IPRIOR35               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR35_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR36_OFFSET        0x0424
#define CH32V_PFIC_IPRIOR36               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR36_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR37_OFFSET        0x0425
#define CH32V_PFIC_IPRIOR37               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR37_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR38_OFFSET        0x0426
#define CH32V_PFIC_IPRIOR38               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR38_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR39_OFFSET        0x0427
#define CH32V_PFIC_IPRIOR39               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR39_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR40_OFFSET        0x0428
#define CH32V_PFIC_IPRIOR40               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR40_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR41_OFFSET        0x0429
#define CH32V_PFIC_IPRIOR41               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR41_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR42_OFFSET        0x042a
#define CH32V_PFIC_IPRIOR42               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR42_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR43_OFFSET        0x042b
#define CH32V_PFIC_IPRIOR43               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR43_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR44_OFFSET        0x042c
#define CH32V_PFIC_IPRIOR44               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR44_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR45_OFFSET        0x042d
#define CH32V_PFIC_IPRIOR45               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR45_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR46_OFFSET        0x042e
#define CH32V_PFIC_IPRIOR46               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR46_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR47_OFFSET        0x042f
#define CH32V_PFIC_IPRIOR47               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR47_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR48_OFFSET        0x0430
#define CH32V_PFIC_IPRIOR48               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR48_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR49_OFFSET        0x0431
#define CH32V_PFIC_IPRIOR49               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR49_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR50_OFFSET        0x0432
#define CH32V_PFIC_IPRIOR50               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR50_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR51_OFFSET        0x0433
#define CH32V_PFIC_IPRIOR51               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR51_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR52_OFFSET        0x0434
#define CH32V_PFIC_IPRIOR52               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR52_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR53_OFFSET        0x0435
#define CH32V_PFIC_IPRIOR53               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR53_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR54_OFFSET        0x0436
#define CH32V_PFIC_IPRIOR54               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR54_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR55_OFFSET        0x0437
#define CH32V_PFIC_IPRIOR55               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR55_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR56_OFFSET        0x0438
#define CH32V_PFIC_IPRIOR56               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR56_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR57_OFFSET        0x0439
#define CH32V_PFIC_IPRIOR57               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR57_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR58_OFFSET        0x043a
#define CH32V_PFIC_IPRIOR58               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR58_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR59_OFFSET        0x043b
#define CH32V_PFIC_IPRIOR59               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR59_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR60_OFFSET        0x043c
#define CH32V_PFIC_IPRIOR60               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR60_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR61_OFFSET        0x043d
#define CH32V_PFIC_IPRIOR61               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR61_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR62_OFFSET        0x043e
#define CH32V_PFIC_IPRIOR62               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR62_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR63_OFFSET        0x043f
#define CH32V_PFIC_IPRIOR63               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR63_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR64_OFFSET        0x0440
#define CH32V_PFIC_IPRIOR64               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR64_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR65_OFFSET        0x0441
#define CH32V_PFIC_IPRIOR65               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR65_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR66_OFFSET        0x0442
#define CH32V_PFIC_IPRIOR66               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR66_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR67_OFFSET        0x0443
#define CH32V_PFIC_IPRIOR67               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR67_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR68_OFFSET        0x0444
#define CH32V_PFIC_IPRIOR68               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR68_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR69_OFFSET        0x0445
#define CH32V_PFIC_IPRIOR69               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR69_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR70_OFFSET        0x0446
#define CH32V_PFIC_IPRIOR70               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR70_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR71_OFFSET        0x0447
#define CH32V_PFIC_IPRIOR71               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR71_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR72_OFFSET        0x0448
#define CH32V_PFIC_IPRIOR72               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR72_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR73_OFFSET        0x0449
#define CH32V_PFIC_IPRIOR73               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR73_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR74_OFFSET        0x044a
#define CH32V_PFIC_IPRIOR74               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR74_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR75_OFFSET        0x044b
#define CH32V_PFIC_IPRIOR75               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR75_OFFSET) /* read-write */
