robertlipe/svdtoheaders/demo/h/ch32v307_reg.h
#define CH32V_CAN2_F3R2_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F3R2_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F3R2_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F3R2_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F3R2_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F3R2_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F3R2_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F3R2_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F3R2_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F3R2_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F3R2_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F3R2_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F3R2_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F3R2_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F4R1_OFFSET            0x0260
#define CH32V_CAN2_F4R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F4R1_OFFSET)
#define CH32V_CAN2_F4R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F4R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F4R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F4R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F4R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F4R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F4R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F4R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F4R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F4R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F4R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F4R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F4R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F4R1_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F4R1_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F4R1_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F4R1_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F4R1_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F4R1_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F4R1_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F4R1_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F4R1_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F4R1_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F4R1_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F4R1_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F4R1_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F4R1_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F4R1_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F4R1_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F4R1_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F4R1_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F4R1_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F4R2_OFFSET            0x0264
#define CH32V_CAN2_F4R2                   (CH32V_CAN2_BASE + CH32V_CAN2_F4R2_OFFSET)
#define CH32V_CAN2_F4R2_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F4R2_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F4R2_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F4R2_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F4R2_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F4R2_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F4R2_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F4R2_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F4R2_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F4R2_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F4R2_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F4R2_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F4R2_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F4R2_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F4R2_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F4R2_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F4R2_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F4R2_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F4R2_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F4R2_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F4R2_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F4R2_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F4R2_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F4R2_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F4R2_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F4R2_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F4R2_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F4R2_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F4R2_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F4R2_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F4R2_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F4R2_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F5R1_OFFSET            0x0268
#define CH32V_CAN2_F5R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F5R1_OFFSET)
#define CH32V_CAN2_F5R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F5R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F5R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F5R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F5R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F5R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F5R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F5R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F5R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F5R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F5R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F5R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F5R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F5R1_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F5R1_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F5R1_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F5R1_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F5R1_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F5R1_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F5R1_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F5R1_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F5R1_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F5R1_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F5R1_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F5R1_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F5R1_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F5R1_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F5R1_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F5R1_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F5R1_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F5R1_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F5R1_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F5R2_OFFSET            0x026c
#define CH32V_CAN2_F5R2                   (CH32V_CAN2_BASE + CH32V_CAN2_F5R2_OFFSET)
#define CH32V_CAN2_F5R2_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F5R2_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F5R2_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F5R2_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F5R2_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F5R2_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F5R2_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F5R2_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F5R2_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F5R2_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F5R2_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F5R2_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F5R2_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F5R2_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F5R2_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F5R2_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F5R2_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F5R2_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F5R2_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F5R2_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F5R2_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F5R2_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F5R2_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F5R2_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F5R2_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F5R2_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F5R2_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F5R2_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F5R2_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F5R2_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F5R2_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F5R2_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F6R1_OFFSET            0x0270
#define CH32V_CAN2_F6R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F6R1_OFFSET)
#define CH32V_CAN2_F6R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F6R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F6R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F6R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F6R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F6R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F6R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F6R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F6R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F6R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F6R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F6R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F6R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F6R1_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F6R1_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F6R1_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F6R1_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F6R1_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F6R1_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F6R1_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F6R1_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F6R1_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F6R1_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F6R1_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F6R1_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F6R1_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F6R1_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F6R1_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F6R1_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F6R1_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F6R1_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F6R1_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F6R2_OFFSET            0x0274
#define CH32V_CAN2_F6R2                   (CH32V_CAN2_BASE + CH32V_CAN2_F6R2_OFFSET)
#define CH32V_CAN2_F6R2_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F6R2_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F6R2_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F6R2_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F6R2_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F6R2_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F6R2_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F6R2_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F6R2_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F6R2_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F6R2_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F6R2_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F6R2_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F6R2_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F6R2_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F6R2_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F6R2_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F6R2_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F6R2_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F6R2_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F6R2_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F6R2_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F6R2_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F6R2_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F6R2_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F6R2_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F6R2_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F6R2_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F6R2_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F6R2_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F6R2_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F6R2_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F7R1_OFFSET            0x0278
#define CH32V_CAN2_F7R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F7R1_OFFSET)
#define CH32V_CAN2_F7R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F7R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F7R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F7R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F7R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F7R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F7R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F7R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F7R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F7R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F7R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F7R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F7R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F7R1_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F7R1_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F7R1_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F7R1_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F7R1_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F7R1_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F7R1_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F7R1_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F7R1_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F7R1_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F7R1_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F7R1_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F7R1_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F7R1_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F7R1_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F7R1_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F7R1_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F7R1_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F7R1_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F7R2_OFFSET            0x027c
#define CH32V_CAN2_F7R2                   (CH32V_CAN2_BASE + CH32V_CAN2_F7R2_OFFSET)
#define CH32V_CAN2_F7R2_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F7R2_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F7R2_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F7R2_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F7R2_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F7R2_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F7R2_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F7R2_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F7R2_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F7R2_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F7R2_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F7R2_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F7R2_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F7R2_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F7R2_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F7R2_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F7R2_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F7R2_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F7R2_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F7R2_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F7R2_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F7R2_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F7R2_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F7R2_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F7R2_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F7R2_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F7R2_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F7R2_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F7R2_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F7R2_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F7R2_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F7R2_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F8R1_OFFSET            0x0280
#define CH32V_CAN2_F8R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F8R1_OFFSET)
#define CH32V_CAN2_F8R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F8R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F8R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F8R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F8R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F8R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F8R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F8R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F8R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F8R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F8R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F8R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F8R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F8R1_FB13              (1 << 13) /* 00002000: Filter bits */
